Repository: MaxwellLei/GeoChemistry-Nexus
Catalog: src/Data/Language/Language.*.resx
Languages: de_de, ja_jp, ko_kr, ru_ru, zh_cn, zh_tw

# FileSavePath
source: Save File Location
de_de: Speicherort
ja_jp: 保存先
ko_kr: 파일 저장 위치
ru_ru: Путь сохранения файла
zh_cn: 保存文件位置
zh_tw: 儲存檔案位置

# DefaultPath
source: Default Location
de_de: Standardpfad
ja_jp: デフォルトの場所
ko_kr: 기본 위치
ru_ru: Путь по умолчанию
zh_cn: 默认位置
zh_tw: 預設位置

# CustomPath
source: Custom Folder Location
de_de: Benutzerdefinierter Ordner
ja_jp: カスタムフォルダの場所
ko_kr: 사용자 지정 폴더 위치
ru_ru: Пользовательская папка
zh_cn: 自定义文件夹位置
zh_tw: 自訂資料夾位置

# OpenFileLocation
source: Open Folder Location
de_de: Dateispeicherort öffnen
ja_jp: フォルダの場所を開く
ko_kr: 폴더 위치 열기
ru_ru: Открыть расположение папки
zh_cn: 打开文件夹位置
zh_tw: 開啟資料夾位置

# InternationalizationAndPersonalization
source: Internationalization & Personalization
de_de: Internationalisierung & Personalisierung
ja_jp: 国際化とパーソナライズ
ko_kr: 국제화 & 개인화
ru_ru: Язык и персонализация
zh_cn: 国际化 & 个性化
zh_tw: 國際化 & 个性化

source: Theme
de_de: Thema
ja_jp: テーマ
ko_kr: 테마
ru_ru: Тема
zh_cn: 主题
zh_tw: 主題

source: Default
de_de: Standard
ja_jp: デフォルト
ko_kr: 기본
ru_ru: По умолчанию
zh_cn: 默认
zh_tw: 預設

source: Language
de_de: Sprache
ja_jp: 言語
ko_kr: 언어
ru_ru: Язык
zh_cn: 语言
zh_tw: 語言

# ChineseS
source: 中文 (简体)
de_de: Chinesisch (Vereinfacht)
zh_tw: 中文(簡體)

source: Default Random
de_de: Standard zufällig
ja_jp: デフォルトランダム
ko_kr: 기본 무작위
ru_ru: Случайно по умолчанию
zh_cn: 默认随机
zh_tw: 預設隨機

source: MESSAGE NOTIFICATION
de_de: Benachrichtigungen
ja_jp: メッセージ通知
ko_kr: 메시지 알림
ru_ru: Уведомления
zh_cn: 消息通知
zh_tw: 訊息通知

# MessageAutoClose
source: Auto-close Time
de_de: Automatische Schließzeit
ja_jp: 自動的に閉じる時間
ko_kr: 자동 닫기 시간
ru_ru: Время автозакрытия
zh_cn: 自动关闭时间
zh_tw: 自動關閉時間

# MessageAutoClose5
source: 5 seconds
de_de: 5 Sekunden
ja_jp: 5 秒
ko_kr: 5초
ru_ru: 5 сек
zh_cn: 5 秒
zh_tw: 5 秒

# MessageAutoClose4
source: 4 seconds
de_de: 4 Sekunden
ja_jp: 4 秒
ko_kr: 4초
ru_ru: 4 сек
zh_cn: 4 秒
zh_tw: 4 秒

# MessageAutoClose3
source: 3 seconds
de_de: 3 Sekunden
ja_jp: 3 秒
ko_kr: 3초
ru_ru: 3 сек
zh_cn: 3 秒
zh_tw: 3 秒

# MessageAutoClose2
source: 2 seconds
de_de: 2 Sekunden
ja_jp: 2 秒
ko_kr: 2초
ru_ru: 2 сек
zh_cn: 2 秒
zh_tw: 2 秒

source: OTHER
de_de: Sonstiges
ja_jp: その他
ko_kr: 기타
ru_ru: Другое
zh_cn: 其他
zh_tw: 其他

# Boot
source: Start with System
de_de: Autostart beim Booten
ja_jp: 起動時に実行
ko_kr: 시작 시 자동 실행
ru_ru: Запуск при загрузке
zh_cn: 开机自启
zh_tw: 開機自動啟動

# AutoCheckUpdate
source: Auto-check for Updates
de_de: Automatisch nach Updates suchen
ja_jp: 更新を自動的に確認
ko_kr: 자동 업데이트 확인
ru_ru: Автопроверка обновлений
zh_cn: 自动检查更新
zh_tw: 自動檢查更新

# CheckUpdate
source: Check for Updates
de_de: Nach Updates suchen
ja_jp: 更新を確認
ko_kr: 업데이트 확인
ru_ru: Проверить обновления
zh_cn: 检查更新
zh_tw: 檢查更新

# QuitAppMode
source: Exit Method
de_de: Beenden-Modus
ja_jp: プログラムの終了方法
ko_kr: 프로그램 종료 방법
ru_ru: Способ выхода
zh_cn: 退出程序方法
zh_tw: 退出程式方法

# MinimizeTray
source: Minimize to Tray
de_de: In Systemtray minimieren
ja_jp: システムトレイに最小化
ko_kr: 트레이로 최소화
ru_ru: Свернуть в трей
zh_cn: 最小化到托盘
zh_tw: 最小化到系統列

# Quit
source: Quit Directly
de_de: Direkt beenden
ja_jp: 直接終了
ko_kr: 바로 종료
ru_ru: Выйти
zh_cn: 直接退出
zh_tw: 直接退出

# AboutInfo1
source: This project utilizes geochemical data for related chart plotting, calculation, and analysis, aiming to efficiently process geological data and help earth science researchers accelerate their data analysis workflow and improve research efficiency.
de_de: Dieses Projekt nutzt geochemische Daten für Diagrammerstellung, Berechnung und Analyse zur effizienten Verarbeitung geologischer Daten. Ziel ist es, Geowissenschaftlern zu helfen, den Datenanalyseprozess zu beschleunigen und die Forschungseffizienz zu verbessern.
ja_jp: 本プロジェクトは、地球化学データを利用した関連図表の作成、計算、分析を通じて、地質学データを効率的に処理し、地球科学研究者のデータ分析プロセスを加速させ、研究効率を向上させることを目的としています。
ko_kr: 이 프로젝트는 지구화학 데이터를 활용하여 관련 차트 작성, 계산 및 분석을 수행하고 지질학 데이터를 효율적으로 처리함으로써 지구과학 연구자들이 데이터 분석 프로세스를 가속화하고 연구 효율성을 높이는 것을 목표로 합니다.
ru_ru: Этот проект использует геохимические данные для построения графиков, расчетов и анализа, помогая исследователям в области наук о Земле ускорить процесс анализа данных и повысить эффективность исследований.
zh_cn: 本项目通过利用地球化学数据进行相关图表绘制、计算与分析，对地质学数据进行高效处理，旨在帮助地球科学研究人员加速数据分析流程，提升研究效率。
zh_tw: 本專案通過利用地球化學資料進行相關圖表繪製、計算與分析，對地質學資料進行高效處理，旨在幫助地球科學研究人員加速資料分析流程，提升研究效率。

# AboutInfo2
source: If you're interested in this project, please consider giving it a Star for support! If you find it helpful, you can also buy me a coffee☕
de_de: Wenn Ihnen dieses Projekt gefällt, geben Sie uns bitte einen Stern zur Unterstützung! Wenn Sie es hilfreich finden, können Sie mir auch einen Kaffee spendieren ☕
ja_jp: もし本プロジェクトに興味をお持ちでしたら、ぜひStarをつけて応援してください！お役に立ちましたら、コーヒーを一杯奢っていただけると嬉しいです☕
ko_kr: 이 프로젝트에 관심이 있으시다면 Star를 눌러 응원해 주세요! 도움이 되셨다면 커피 한 잔 사주셔도 좋습니다 ☕
ru_ru: Если вам интересен этот проект, поставьте звездочку (Star)! Если вы считаете его полезным, можете угостить меня кофе ☕
zh_cn: 如果您对本项目感兴趣，欢迎点个 Star 支持一下！如果您觉得对您有帮助，也可以请我喝杯咖啡☕
zh_tw: 如果您對本專案感興趣，歡迎點個 Star 支持一下！如果您覺得對您有幫助，也可以請我喝杯咖啡☕

# AboutInfo3
source: We welcome more researchers to join! Let's maintain and update geochemical calculation methods together, and create more plotting templates! Make the software more powerful and user-friendly!
de_de: Wir begrüßen weitere Forscher! Lassen Sie uns gemeinsam geochemische Berechnungsmethoden und weitere Diagrammvorlagen pflegen und aktualisieren! Damit die Software leistungsfähiger und benutzerfreundlicher wird!
ja_jp: より多くの研究者の皆様の参加を歓迎します！ 地球化学計算手法や、より多くの描画ベースマップテンプレートを一緒に維持・更新しましょう！ ソフトウェアをより強力で使いやすいものにしていきましょう！
ko_kr: 더 많은 연구자분들의 참여를 환영합니다! 함께 지구화학 계산 방법과 더 많은 플롯 베이스맵 템플릿을 유지 관리하고 업데이트합시다! 소프트웨어를 더 강력하고 사용하기 쉽게 만들어 봅시다!
ru_ru: Мы приглашаем исследователей присоединиться! Вместе мы будем поддерживать и обновлять методы геохимических расчетов и шаблоны диаграмм! Сделаем программное обеспечение более мощным и удобным!
zh_cn: 我们欢迎更多的研究人员加入！ 一起维护和更新地球化学计算的方法，还有更多的绘图底图模板！ 让软件变得更强大，更好用！
zh_tw: 我們歡迎更多的研究人員加入！ 一起維護和更新地球化學計算的方法，還有更多的繪圖底圖範本！ 讓軟體變得更強大，更好用！

# ThankSupport
source: Thanks for the Support
de_de: Danke für die Unterstützung
ja_jp: ご支援ありがとうございます
ko_kr: 지원에 감사드립니다
ru_ru: Спасибо за поддержку
zh_cn: 感谢支持
zh_tw: 感謝支持

# Support1
source: 📌Control Support:
de_de: 📌Steuerelemente:
ja_jp: 📌コントロールのサポート:
ko_kr: 📌컨트롤 지원:
ru_ru: 📌Элементы управления:
zh_cn: 📌控件支持:
zh_tw: 📌控制項支援:

# Support3
source: 📌Documentation Support:
de_de: 📌Dokumentation:
ja_jp: 📌ドキュメントのサポート:
ko_kr: 📌문서 지원:
ru_ru: 📌Документация:
zh_cn: 📌文档支持:
zh_tw: 📌文件支援:

# Support4
source: 📌Calculation Support:
de_de: 📌Berechnung:
ja_jp: 📌計算のサポート:
ko_kr: 📌계산 지원:
ru_ru: 📌Расчеты:
zh_cn: 📌计算支持:
zh_tw: 📌計算支援:

# Support2
source: 📌Chart Support:
de_de: 📌Diagramme:
ja_jp: 📌チャートのサポート:
ko_kr: 📌차트 지원:
ru_ru: 📌Диаграммы:
zh_cn: 📌图表支持:
zh_tw: 📌圖表支援:

# Support5
source: 📌Tool Support:
de_de: 📌Tools:
ja_jp: 📌ツールのサポート:
ko_kr: 📌도구 지원:
ru_ru: 📌Инструменты:
zh_cn: 📌工具支持:
zh_tw: 📌工具支援:

# PlotBoder
source: Border
de_de: Rahmen
ja_jp: 境界
ko_kr: 경계
ru_ru: Граница
zh_cn: 边界
zh_tw: 邊界

# ResetSuccess
source: Reset Successful
de_de: Erfolgreich zurückgesetzt
ja_jp: リセットしました
ko_kr: 초기화 성공
ru_ru: Сброс выполнен успешно
zh_cn: 重置成功
zh_tw: 重置成功

# ModifedSuccess
source: Modified Successfully
de_de: Erfolgreich geändert
ja_jp: 変更しました
ko_kr: 수정 성공
ru_ru: Изменено успешно
zh_cn: 修改成功
zh_tw: 修改成功

# ModifedCanceled
source: Modification Canceled
de_de: Änderung abgebrochen
ja_jp: 変更を取り消しました
ko_kr: 수정 취소됨
ru_ru: Изменение отменено
zh_cn: 取消修改
zh_tw: 取消修改

# Info1
source: Please visit the official website, this feature is under development....
ja_jp: 公式サイトをご覧ください。この機能は開発中です...
zh_tw: 請前往官網檢視，該功能開發中....

# import_template
source: Import Plotting Template
de_de: Diagrammvorlage importieren
ja_jp: 描画テンプレートをインポート
ko_kr: 플롯 템플릿 가져오기
ru_ru: Импорт шаблона диаграммы
zh_cn: 导入绘图模板
zh_tw: 匯入繪圖範本

# create_new_diagram_template
source: New Diagram Template
de_de: Neue Diagrammvorlage erstellen
ja_jp: 図解テンプレートを新規作成
ko_kr: 새 다이어그램 템플릿 만들기
ru_ru: Создать шаблон диаграммы
zh_cn: 新建图解模板
zh_tw: 新增圖解範本

source: Template Library
de_de: Vorlagenbibliothek
ja_jp: テンプレートライブラリ
ko_kr: 템플릿 라이브러리
ru_ru: Библиотека шаблонов
zh_cn: 模板库
zh_tw: 範本庫

# return_to_template_library
source: Back
de_de: Zurück
ja_jp: 戻る
ko_kr: 돌아가기
ru_ru: Вернуться
zh_cn: 返回
zh_tw: 返回

source: Data
de_de: Daten
ja_jp: データ
ko_kr: 데이터
ru_ru: Данные
zh_cn: 数据
zh_tw: 資料

source: Import Data
de_de: Daten importieren
ja_jp: データをインポート
ko_kr: 데이터 가져오기
ru_ru: Импорт данных
zh_cn: 导入数据
zh_tw: 匯入資料

source: Clear Data
de_de: Daten löschen
ja_jp: データをクリア
ko_kr: 데이터 지우기
ru_ru: Очистить данные
zh_cn: 清除数据
zh_tw: 清除資料

source: View
de_de: Ansicht
ja_jp: 表示
ko_kr: 뷰
ru_ru: Вид
zh_cn: 视图
zh_tw: 檢視

source: Reset View
de_de: Ansicht zurücksetzen
ja_jp: ビューをリセット
ko_kr: 뷰 재설정
ru_ru: Сбросить вид
zh_cn: 复位视图
zh_tw: 重設檢視

# coordinate_positioning
source: Coordinate
de_de: Koordinatenpositionierung
ja_jp: 座標位置合わせ
ko_kr: 좌표 위치 지정
ru_ru: Координаты
zh_cn: 坐标定位
zh_tw: 座標定位

source: Select
de_de: Auswählen
ja_jp: 選択
ko_kr: 선택
ru_ru: Выбрать
zh_cn: 选择
zh_tw: 選擇

source: Deselect
de_de: Auswahl aufheben
ja_jp: 選択解除
ko_kr: 선택 취소
ru_ru: Отменить выбор
zh_cn: 取消选中
zh_tw: 取消選取

source: Export
de_de: Exportieren
ja_jp: エクスポート
ko_kr: 내보내기
ru_ru: Экспорт
zh_cn: 导出
zh_tw: 匯出

source: Export Image
de_de: Bild exportieren
ja_jp: 画像をエクスポート
ko_kr: 이미지 내보내기
ru_ru: Экспорт изображения
zh_cn: 导出图片
zh_tw: 匯出圖片

source: PNG Format
ja_jp: PNG 形式
ko_kr: PNG 형식
ru_ru: Формат PNG
zh_cn: PNG 格式
zh_tw: PNG 格式

source: BMP Format
ja_jp: BMP 形式
ko_kr: BMP 형식
ru_ru: Формат BMP
zh_cn: BMP 格式
zh_tw: BMP 格式

source: JPG Format
ja_jp: JPG 形式
ko_kr: JPG 형식
ru_ru: Формат JPG
zh_cn: JPG 格式
zh_tw: JPG 格式

source: WebP Format
ja_jp: WebP 形式
ko_kr: WebP 형식
ru_ru: Формат WebP
zh_cn: WebP 格式
zh_tw: WebP 格式

source: SVG Format
ja_jp: SVG 形式
ko_kr: SVG 형식
ru_ru: Формат SVG
zh_cn: SVG 格式
zh_tw: SVG 格式

# legend_settings
source: Legend
de_de: Legendeneinstellungen
ja_jp: 凡例設定
ko_kr: 범례 설정
ru_ru: Настройки легенды
zh_cn: 图例设置
zh_tw: 圖例設定

# grid_settings
source: Grid
de_de: Gittereinstellungen
ja_jp: グリッド設定
ko_kr: 그리드 설정
ru_ru: Настройки сетки
zh_cn: 网格设置
zh_tw: 網格設定

# script_settings
source: Script
de_de: Skripteinstellungen
ja_jp: スクリプト設定
ko_kr: 스크립트 설정
ru_ru: Настройки скрипта
zh_cn: 脚本设置
zh_tw: 腳本設定

# plot_settings
source: Plot
de_de: Diagrammeinstellungen
ja_jp: 描画設定
ko_kr: 플롯 설정
ru_ru: Настройки графика
zh_cn: 绘图设置
zh_tw: 繪圖設定

source: All Templates
de_de: Alle Vorlagen
ja_jp: 全てのテンプレート
ko_kr: 모든 템플릿
ru_ru: Все шаблоны
zh_cn: 全部模板
zh_tw: 全部範本

source: Uncategorized
de_de: Unkategorisiert
ja_jp: 未分類
ko_kr: 분류되지 않음
ru_ru: Без категории
zh_cn: 未分类
zh_tw: 未分類

# disallow_modify_data_point_position
source: Disallow Modification of Data Point Position
ja_jp: データポイント位置の変更を許可しない
zh_tw: 不允許修改資料點位置

# load_valid_template_with_script
source: Please load a valid chart template. The template must include calculation script configurations
ja_jp: まず有効なチャートテンプレートを読み込んでください。テンプレートには計算スクリプトの設定が含まれている必要があります。
zh_tw: 請先載入有效的圖表範本，範本中必須包含計算腳本配置

# incomplete_script_config
source: The script configuration in the template is incomplete. Please check RequiredDataSeries and ScriptBody
ja_jp: テンプレートのスクリプト設定が不完全です。RequiredDataSeriesとScriptBodyを確認してください。
zh_tw: 範本中的腳本配置不完整，請檢查RequiredDataSeries和ScriptBody

source: Select Data File
de_de: Bitte Datendatei auswählen
ja_jp: データファイルを選択してください
ko_kr: 데이터 파일을 선택하십시오
ru_ru: Выберите файл данных
zh_cn: 请选择数据文件
zh_tw: 請選擇資料檔案

# data_file_filter
source: Data Files (*.csv, *.xls, *.xlsx)|*.csv;*.xls;*.xlsx
de_de: Datendatei (*.csv, *.xls, *.xlsx)|*.csv;*.xls;*.xlsx
ja_jp: データファイル (*.csv, *.xls, *.xlsx)|*.csv;*.xls;*.xlsx
ko_kr: 데이터 파일 (*.csv, *.xls, *.xlsx)|*.csv;*.xls;*.xlsx
ru_ru: Файлы данных (*.csv, *.xls, *.xlsx)|*.csv;*.xls;*.xlsx
zh_cn: 数据文件 (*.csv, *.xls, *.xlsx)|*.csv;*.xls;*.xlsx
zh_tw: 資料檔案 (*.csv, *.xls, *.xlsx)|*.csv;*.xls;*.xlsx

# no_valid_workbook_or_data_found
source: No valid workbook or data found in the file
de_de: Keine gültige Arbeitsmappe oder Daten in der Datei gefunden
ja_jp: ファイル内に有効なワークブックまたはデータが見つかりません
ko_kr: 파일에서 유효한 통합 문서나 데이터를 찾을 수 없습니다
ru_ru: Допустимые рабочие книги или данные в файле не найдены
zh_cn: 无法在文件中找到任何有效的工作簿或数据
zh_tw: 無法在檔案中找到任何有效的工作簿或資料

# read_file_failed
source: Failed to Read File
de_de: Lesen der Datei fehlgeschlagen
ja_jp: ファイルの読み込みに失敗しました
ko_kr: 파일 읽기 실패
ru_ru: Ошибка чтения файла
zh_cn: 读取文件失败
zh_tw: 讀取檔案失敗

# script_config_error_required_data_series
source: Script configuration error: RequiredDataSeries must contain at least one category column and one data column
ja_jp: スクリプト設定エラー：RequiredDataSeriesには、少なくともカテゴリ列と1つのデータ列が必要です。
zh_tw: 腳本配置錯誤：RequiredDataSeries至少需要包含類別欄和一個資料欄

# excel_missing_required_columns
source: The Excel file is missing the following required columns
de_de: Excel-Datei fehlen erforderliche Spalten
ja_jp: Excelファイルに以下の必須列が不足しています
ko_kr: Excel 파일에 다음 필수 열이 누락되었습니다
ru_ru: В файле Excel отсутствуют следующие обязательные столбцы
zh_cn: Excel文件缺少以下必需的列
zh_tw: Excel檔案缺少以下必需的欄位

source: Data Point
de_de: Datenpunkt
ja_jp: データポイント
ko_kr: 데이터 포인트
ru_ru: Точка данных
zh_cn: 数据点
zh_tw: 資料點

# failed_to_parse_category_group
source: Failed to parse valid category groupings from the file. Please check the category column data
de_de: Konnte keine gültige Kategoriegruppe aus der Datei parsen. Bitte Kategoriespaltendaten prüfen
ja_jp: ファイルから有効なカテゴリグループを解析できませんでした。カテゴリ列のデータを確認してください。
ko_kr: 파일에서 유효한 범주 그룹을 구문 분석하지 못했습니다. 범주 열 데이터를 확인하십시오
ru_ru: Не удалось разобрать группы категорий из файла. Проверьте данные столбца категорий
zh_cn: 未能从文件中解析出有效的类别分组。请检查类别列数据
zh_tw: 未能從檔案中解析出有效的類別分組。請檢查類別欄資料

source: Error calculating data point coordinates:
de_de: Fehler beim Berechnen der Datenpunktkoordinaten:
ja_jp: データポイント座標の計算中にエラーが発生しました:
ko_kr: 데이터 포인트 좌표 계산 중 오류 발생:
ru_ru: Ошибка при расчете координат точки данных:
zh_cn: 计算数据点坐标时出错:
zh_tw: 計算資料點座標時出錯:

source: Data Import Successful
de_de: Datenimport erfolgreich
ja_jp: データのインポートに成功しました
ko_kr: 데이터 가져오기 성공
ru_ru: Импорт данных успешен
zh_cn: 数据导入成功
zh_tw: 資料匯入成功

source: Script execution failed:
de_de: Skriptausführung fehlgeschlagen:
ja_jp: スクリプトの実行に失敗しました:
ko_kr: 스크립트 실행 실패:
ru_ru: Ошибка выполнения скрипта:
zh_cn: 脚本执行失败:
zh_tw: 腳本執行失敗:

source: Axes
de_de: Achsen
ja_jp: 座標軸
ko_kr: 좌표축
ru_ru: Оси
zh_cn: 坐标轴
zh_tw: 座標軸

source: Point
de_de: Punkt
ja_jp: 点
ko_kr: 점
ru_ru: Точка
zh_cn: 点
zh_tw: 點

source: Line
de_de: Linie
ja_jp: 線
ko_kr: 선
ru_ru: Линия
zh_cn: 线
zh_tw: 線

source: Text
ja_jp: テキスト
ko_kr: 텍스트
ru_ru: Текст
zh_cn: 文本
zh_tw: 文字

source: Annotation
de_de: Anmerkung
ja_jp: 注釈
ko_kr: 주석
ru_ru: Аннотация
zh_cn: 注释
zh_tw: 註釋

# image_copied_to_clipboard
source: Image copied to clipboard successfully
de_de: Bild erfolgreich in die Zwischenablage kopiert
ja_jp: 画像がクリップボードにコピーされました
ko_kr: 이미지가 클립보드에 성공적으로 복사되었습니다
ru_ru: Изображение скопировано в буфер обмена
zh_cn: 图像已成功复制到剪贴板
zh_tw: 影像已成功複製到剪貼簿

source: Copy failed:
de_de: Kopieren fehlgeschlagen:
ja_jp: コピーに失敗しました:
ko_kr: 복사 실패:
ru_ru: Ошибка копирования:
zh_cn: 复制失败:
zh_tw: 複製失敗:

# confirm_clear_data_points
source: Clear data points?
de_de: Datenpunkte löschen?
ja_jp: データポイントをクリアしますか？
ko_kr: 데이터 포인트를 지우시겠습니까?
ru_ru: Очистить точки данных?
zh_cn: 是否清除数据点？
zh_tw: 是否清除資料點？

# no_imported_data_to_clear
source: There is no imported data to clear
de_de: Keine importierten Daten zum Löschen vorhanden
ja_jp: クリアするインポートデータがありません
ko_kr: 지울 가져온 데이터가 없습니다
ru_ru: Нет импортированных данных для очистки
zh_cn: 当前没有可清除的导入数据
zh_tw: 目前沒有可清除的匯入資料

# all_imported_data_cleared
source: All imported data has been cleared
de_de: Alle importierten Daten gelöscht
ja_jp: すべてのインポートデータがクリアされました
ko_kr: 모든 가져온 데이터가 지워졌습니다
ru_ru: Все импортированные данные очищены
zh_cn: 已清除所有导入的数据
zh_tw: 已清除所有匯入的資料

source: Left Y-Axis
de_de: Linke Y-Achse
ja_jp: 左 Y 軸
ko_kr: 왼쪽 Y축
ru_ru: Левая ось Y
zh_cn: 左 Y 轴
zh_tw: 左 Y 軸

source: Right Y-Axis
de_de: Rechte Y-Achse
ja_jp: 右 Y 軸
ko_kr: 오른쪽 Y축
ru_ru: Правая ось Y
zh_cn: 右 Y 轴
zh_tw: 右 Y 軸

source: Bottom X-Axis
de_de: Untere X-Achse
ja_jp: 下 X 軸
ko_kr: 하단 X축
ru_ru: Нижняя ось X
zh_cn: 下 X 轴
zh_tw: 下 X 軸

source: Top X-Axis
de_de: Obere X-Achse
ja_jp: 上 X 軸
ko_kr: 상단 X축
ru_ru: Верхняя ось X
zh_cn: 上 X 轴
zh_tw: 上 X 軸

source: Unknown Axis
de_de: Unbekannte Achse
ja_jp: 不明な座標軸
ko_kr: 알 수 없는 좌표축
ru_ru: Неизвестная ось
zh_cn: 未知坐标轴
zh_tw: 未知座標軸

source: Content and Position
de_de: Inhalt und Position
ja_jp: 内容と位置
ko_kr: 내용 및 위치
ru_ru: Содержание и позиция
zh_cn: 内容与位置
zh_tw: 內容與位置

# script_definition
source: Script
de_de: Skriptdefinition
ja_jp: スクリプト
ko_kr: 스크립트
ru_ru: Скрипт
zh_cn: 脚本
zh_tw: 腳本

source: Script Language:
de_de: Skriptsprache:
ja_jp: スクリプト言語:
ko_kr: 스크립트 언어:
ru_ru: Язык скрипта:
zh_cn: 脚本语言:
zh_tw: 腳本語言:

source: Data Series
de_de: Datenserie
ja_jp: データ系列
ko_kr: 데이터 계열
ru_ru: Серии данных
zh_cn: 数据系列
zh_tw: 資料系列

# multiple_data_series_hint
source: Separate multiple data series with commas, e.g., SiO2, K2O
de_de: Mehrere Datenserien bitte mit Komma trennen, z.B.: SiO2,TiO2
ja_jp: 複数のデータ系列はカンマで区切ってください（例：SiO2,TiO2）
ko_kr: 여러 데이터 계열은 쉼표로 구분하십시오. 예: SiO2,TiO2
ru_ru: Разделяйте несколько серий данных запятыми, например: SiO2,TiO2
zh_cn: 多个数据系列请用逗号分隔，例如：SiO2,TiO2
zh_tw: 多個資料系列請用逗號分隔，例如：SiO2,TiO2

source: Script Content:
de_de: Skriptinhalt:
ja_jp: スクリプト内容:
ko_kr: 스크립트 내용:
ru_ru: Содержание скрипта:
zh_cn: 脚本内容:
zh_tw: 腳本內容:

source: Ready
de_de: Bereit
ja_jp: 準備完了
ko_kr: 준비됨
ru_ru: Готово
zh_cn: 就绪
zh_tw: 就緒

source: Validate Syntax
de_de: Syntax prüfen
ja_jp: 構文を検証
ko_kr: 구문 검사
ru_ru: Проверить синтаксис
zh_cn: 验证语法
zh_tw: 驗證語法

source: Row:
de_de: Zeile:
ja_jp: 行:
ko_kr: 행:
ru_ru: Стр:
zh_cn: 行:
zh_tw: 列:

source: Column:
de_de: Spalte:
ja_jp: 列:
ko_kr: 열:
ru_ru: Кол:
zh_cn: 列:
zh_tw: 欄:

source: Code Formatted
de_de: Code formatiert
ja_jp: コードを整形しました
ko_kr: 코드가 서식 지정됨
ru_ru: Код отформатирован
zh_cn: 代码已格式化
zh_tw: 程式碼已格式化

source: Format failed:
de_de: Formatierung fehlgeschlagen:
ja_jp: 整形に失敗しました:
ko_kr: 서식 지정 실패:
ru_ru: Ошибка форматирования:
zh_cn: 格式化失败:
zh_tw: 格式化失敗:

source: Script content is empty
de_de: Skriptinhalt ist leer
ja_jp: スクリプトの内容が空です
ko_kr: 스크립트 내용이 비어 있음
ru_ru: Скрипт пуст
zh_cn: 脚本内容为空
zh_tw: 腳本內容為空

source: Validation failed:
de_de: Validierung fehlgeschlagen:
ja_jp: 検証に失敗しました:
ko_kr: 검사 실패:
ru_ru: Проверка не удалась:
zh_cn: 验证失败:
zh_tw: 驗證失敗:

source: Data parameters are empty
de_de: Datenparameter sind leer
ja_jp: データパラメータが空です
ko_kr: 데이터 매개변수가 비어 있음
ru_ru: Параметры данных пусты
zh_cn: 数据参数为空
zh_tw: 資料參數為空

# invalid_data_parameter_format
source: Data parameter format is incorrect
de_de: Ungültiges Datenparameterformat
ja_jp: データパラメータの形式が正しくありません
ko_kr: 데이터 매개변수 형식이 올바르지 않음
ru_ru: Неверный формат параметров данных
zh_cn: 数据参数格式不正确
zh_tw: 資料參數格式不正確

# parameter_format_correct
source: Parameter format is correct
de_de: Parameterformat korrekt
ja_jp: パラメータ形式は正しいです
ko_kr: 매개변수 형식이 올바름
ru_ru: Формат параметров верен
zh_cn: 参数格式正确
zh_tw: 參數格式正確

source: Syntax validation passed
de_de: Syntaxvalidierung bestanden
ja_jp: 構文検証に合格しました
ko_kr: 구문 검사 통과
ru_ru: Синтаксис корректен
zh_cn: 语法验证通过
zh_tw: 語法驗證通過

source: Error:
de_de: Fehler:
ja_jp: エラー:
ko_kr: 오류:
ru_ru: Ошибка:
zh_cn: 错误:
zh_tw: 錯誤:

# new
source: _New(N)
de_de: _Neu(N)
ja_jp: 新規作成(_N)
ko_kr: 새로 만들기(_N)
ru_ru: _Новый(N)
zh_cn: _新建(N)
zh_tw: _新增(N)

# open
source: _Open(O)
de_de: _Öffnen(O)
ja_jp: 開く(_O)
ko_kr: 열기(_O)
ru_ru: _Открыть(O)
zh_cn: _打开(O)
zh_tw: _開啟(O)

# export_current_worksheet
source: _Export Current Worksheet(R)
de_de: _Aktuelles Arbeitsblatt exportieren(R)
ja_jp: 現在のワークシートをエクスポート(_R)
ko_kr: 현재 워크시트 내보내기(_R)
ru_ru: _Экспорт текущего листа(R)
zh_cn: _导出当前工作表(R)
zh_tw: _匯出目前工作表(R)

source: Geological Thermometer
de_de: Geologisches Thermometer
ja_jp: 地質温度計
ko_kr: 지질 온도계
ru_ru: Геологический термометр
zh_cn: 地质温度计
zh_tw: 地質溫度計

# confirm_new_worksheet
source: Create a new worksheet?
de_de: Neues Arbeitsblatt erstellen?
ja_jp: ワークシートを新規作成しますか？
ko_kr: 새 워크시트를 만드시겠습니까?
ru_ru: Создать новый рабочий лист?
zh_cn: 是否新建工作表？
zh_tw: 是否新增工作表？

source: Error creating table:
de_de: Fehler beim Erstellen der Tabelle:
ja_jp: テーブル作成中にエラーが発生しました:
ko_kr: 테이블 생성 중 오류 발생:
ru_ru: Ошибка при создании таблицы:
zh_cn: 创建表格时发生错误:
zh_tw: 建立表格時發生錯誤:

source: File Import Successful
de_de: Dateiimport erfolgreich
ja_jp: ファイルのインポートに成功しました
ko_kr: 파일 가져오기 성공
ru_ru: Файл успешно импортирован
zh_cn: 文件导入成功
zh_tw: 檔案匯入成功

source: Cancel Import
de_de: Import abbrechen
ja_jp: インポートをキャンセル
ko_kr: 가져오기 취소
ru_ru: Отменить импорт
zh_cn: 取消导入
zh_tw: 取消匯入

source: Export Successful
de_de: Export erfolgreich
ja_jp: エクスポートに成功しました
ko_kr: 내보내기 성공
ru_ru: Экспорт успешен
zh_cn: 导出成功
zh_tw: 匯出成功

source: Export failed:
de_de: Export fehlgeschlagen:
ja_jp: エクスポートに失敗しました:
ko_kr: 내보내기 실패:
ru_ru: Ошибка экспорта:
zh_cn: 导出失败:
zh_tw: 匯出失敗:

# create_worksheet_failed
source: Failed to create worksheet:
de_de: Arbeitsblatterstellung fehlgeschlagen:
ja_jp: ワークシートの作成に失敗しました:
ko_kr: 워크시트 만들기 실패:
ru_ru: Ошибка создания листа:
zh_cn: 创建工作表失败:
zh_tw: 建立工作表失敗:

source: Row: 1, Column: 1
de_de: Zeile: 1, Spalte: 1
ja_jp: 行: 1, 列: 1
ko_kr: 행: 1, 열: 1
ru_ru: Стр: 1, Кол: 1
zh_cn: 行: 1, 列: 1
zh_tw: 列: 1, 欄: 1

source: Missing Parameters
de_de: Fehlende Parameter
ja_jp: パラメータが不足しています
ko_kr: 매개변수 누락
ru_ru: Отсутствуют параметры
zh_cn: 缺少参数
zh_tw: 缺少參數

# input_out_of_range
source: Input value out of range
de_de: Eingabewert außerhalb des Bereichs
ja_jp: 入力値が範囲外です
ko_kr: 입력 값이 범위를 벗어남
ru_ru: Значение вне диапазона
zh_cn: 输入值超出范围
zh_tw: 輸入值超出範圍

# must_be_positive_number
source: Must be a positive number
de_de: Muss eine positive Zahl sein
ja_jp: 正の数である必要があります
ko_kr: 양수여야 함
ru_ru: Должно быть положительным числом
zh_cn: 必须是正数
zh_tw: 必須是正數

# tio2_activity_range
source: TiO2 activity must be within the range (0, 1]
de_de: TiO2-Aktivität muss im Bereich (0,1] liegen
ja_jp: TiO2活量は (0,1] の範囲内である必要があります
ko_kr: TiO2 활동도는 (0,1] 범위 내에 있어야 함
ru_ru: Активность TiO2 должна быть в диапазоне (0,1]
zh_cn: TiO2活度必须在(0,1]范围内
zh_tw: TiO2活度必須在(0,1]範圍內

# oxygen_atom_benchmark_zero
source: Oxygen atom number benchmark is zero
de_de: Sauerstoffatom-Basiswert ist null
ja_jp: 酸素原子数の基準値がゼロです
ko_kr: 산소 원자 기준 값이 0임
ru_ru: Базовое значение атомов кислорода равно нулю
zh_cn: 氧原子数基准值为零
zh_tw: 氧原子數基準值為零

source: Normalization factor is zero
de_de: Normalisierungsfaktor ist null
ja_jp: 正規化係数がゼロです
ko_kr: 정규화 인자가 0임
ru_ru: Коэффициент нормализации равен нулю
zh_cn: 归一化因子为零
zh_tw: 歸一化因子為零

# temperature_calculation_denominator_zero
source: Temperature calculation denominator is zero
de_de: Nenner bei Temperaturberechnung ist null
ja_jp: 温度計算の分母がゼロです
ko_kr: 온도 계산 분모가 0임
ru_ru: Знаменатель в расчете температуры равен нулю
zh_cn: 温度计算分母为零
zh_tw: 溫度計算分母為零

source: Color
de_de: Farbe
ja_jp: 色
ko_kr: 색상
ru_ru: Цвет
zh_cn: 颜色
zh_tw: 顏色

source: Style
de_de: Stil
ja_jp: スタイル
ko_kr: 스타일
ru_ru: Стиль
zh_cn: 样式
zh_tw: 樣式

source: Width
de_de: Breite
ja_jp: 幅
ko_kr: 너비
ru_ru: Ширина
zh_cn: 宽度
zh_tw: 寬度

source: Line Width
de_de: Linienbreite
ja_jp: 線の幅
ko_kr: 선 두께
ru_ru: Ширина линии
zh_cn: 线条宽度
zh_tw: 線條寬度

# Enum_LineType_Solid
source: Solid
de_de: Durchgezogen
ja_jp: 実線
ko_kr: 실선
ru_ru: Сплошная
zh_cn: 实线
zh_tw: 實線

source: Type
de_de: Typ
ja_jp: タイプ
ko_kr: 유형
ru_ru: Тип
zh_cn: 类型
zh_tw: 類型

source: Position
ja_jp: プロパティ
ko_kr: 속성
ru_ru: Свойства
zh_cn: 属性
zh_tw: 屬性

source: Start Coordinates
de_de: Startkoordinaten
ja_jp: 開始座標
ko_kr: 시작 좌표
ru_ru: Начальные координаты
zh_cn: 起始坐标
zh_tw: 起始座標

source: End Coordinates
de_de: Endkoordinaten
ja_jp: 終了座標
ko_kr: 끝 좌표
ru_ru: Конечные координаты
zh_cn: 终止坐标
zh_tw: 終止座標

source: Content
de_de: Inhalt
ja_jp: 内容
ko_kr: 내용
ru_ru: Содержание
zh_cn: 内容
zh_tw: 內容

source: Alignment
de_de: Ausrichtung
ja_jp: アンカー位置
ko_kr: 앵커 위치
ru_ru: Привязка
zh_cn: 锚点位置
zh_tw: 錨點位置

source: Font Style
de_de: Schriftstil
ja_jp: フォントスタイル
ko_kr: 글꼴 스타일
ru_ru: Стиль шрифта
zh_cn: 字体样式
zh_tw: 字型樣式

source: Font Name
de_de: Schriftartname
ja_jp: フォント名
ko_kr: 글꼴 이름
ru_ru: Название шрифта
zh_cn: 字体名称
zh_tw: 字型名稱
