Repository: MaxwellLei/GeoChemistry-Nexus
Catalog: src/Data/Language/Language.*.resx
Languages: de_de, ja_jp, ko_kr, ru_ru, zh_cn, zh_tw

source: Font Size
de_de: Schriftgröße
ja_jp: フォントサイズ
ko_kr: 글꼴 크기
ru_ru: Размер шрифта
zh_cn: 字体大小
zh_tw: 字型大小

source: Font Rotation
de_de: Schriftrotation
ja_jp: フォントの回転
ko_kr: 글꼴 회전
ru_ru: Вращение шрифта
zh_cn: 字体旋转
zh_tw: 字型旋轉

source: Font Color
de_de: Schriftfarbe
ja_jp: フォントの色
ko_kr: 글꼴 색상
ru_ru: Цвет шрифта
zh_cn: 字体颜色
zh_tw: 字型顏色

source: Bold
de_de: Fett
ja_jp: 太字
ko_kr: 굵게
ru_ru: Жирный
zh_cn: 粗体
zh_tw: 粗體

source: Italic
de_de: Kursiv
ja_jp: 斜体
ko_kr: 기울임꼴
ru_ru: Курсив
zh_cn: 斜体
zh_tw: 斜體

source: Background and Border
de_de: Hintergrund und Rahmen
ja_jp: 背景と枠線
ko_kr: 배경 및 테두리
ru_ru: Фон и границы
zh_cn: 背景与边框
zh_tw: 背景與邊框

source: Background Color
de_de: Hintergrundfarbe
ja_jp: 背景色
ko_kr: 배경 색상
ru_ru: Цвет фона
zh_cn: 背景颜色
zh_tw: 背景顏色

source: Border Color
de_de: Rahmenfarbe
ja_jp: 枠線の色
ko_kr: 테두리 색상
ru_ru: Цвет границы
zh_cn: 边框颜色
zh_tw: 邊框顏色

source: Border Width
de_de: Rahmenbreite
ja_jp: 枠線の幅
ko_kr: 테두리 두께
ru_ru: Ширина границы
zh_cn: 边框宽度
zh_tw: 邊框寬度

source: Corner Radius
de_de: Eckenradius
ja_jp: 角丸の半径
ko_kr: 모서리 반경
ru_ru: Радиус скругления
zh_cn: 圆角半径
zh_tw: 圓角半徑

source: Advanced Rendering
de_de: Erweitertes Rendering
ja_jp: 高度なレンダリング
ko_kr: 고급 렌더링
ru_ru: Расширенный рендеринг
zh_cn: 高级渲染
zh_tw: 進階渲染

source: Anti Aliasing
ja_jp: アンチエイリアス
ko_kr: 앤티 앨리어싱
ru_ru: Сглаживание
zh_cn: 抗锯齿
zh_tw: 抗鋸齒

source: Axis Style
de_de: Achsenstil
ja_jp: 座標軸のスタイル
ko_kr: 좌표축 스타일
ru_ru: Стиль осей
zh_cn: 坐标轴样式
zh_tw: 座標軸樣式

source: Axis Title
de_de: Achsentitel
ja_jp: 座標軸のタイトル
ko_kr: 좌표축 제목
ru_ru: Заголовок оси
zh_cn: 坐标轴标题
zh_tw: 座標軸標題

source: Font Family
de_de: Schriftfamilie
ja_jp: フォントファミリ
ko_kr: 글꼴
ru_ru: Шрифт
zh_cn: 字体
zh_tw: 字型

source: Tick Style
de_de: Strichstil
ja_jp: 目盛のスタイル
ko_kr: 눈금 스타일
ru_ru: Стиль делений
zh_cn: 刻度样式
zh_tw: 刻度樣式

source: Tick Interval
de_de: Strichintervall
ja_jp: 目盛の間隔
ko_kr: 눈금 간격
ru_ru: Интервал делений
zh_cn: 刻度间隔
zh_tw: 刻度間隔

source: Major Tick Style
de_de: Hauptstrichstil
ja_jp: 主目盛のスタイル
ko_kr: 주 눈금 스타일
ru_ru: Стиль основных делений
zh_cn: 主刻度样式
zh_tw: 主刻度樣式

source: Length
de_de: Länge
ja_jp: 長さ
ko_kr: 길이
ru_ru: Длина
zh_cn: 长度
zh_tw: 長度

source: Minor Tick Style
de_de: Nebenstrichstil
ja_jp: 副目盛のスタイル
ko_kr: 보조 눈금 스타일
ru_ru: Стиль вспомогательных делений
zh_cn: 次刻度样式
zh_tw: 次刻度樣式

source: Tick Labels
de_de: Strichbeschriftungen
ja_jp: 目盛ラベル
ko_kr: 눈금 레이블
ru_ru: Метки делений
zh_cn: 刻度标签
zh_tw: 刻度標籤

source: Location
de_de: Ort
ja_jp: 位置
ko_kr: 위치
ru_ru: Расположение
zh_cn: 位置
zh_tw: 位置

source: Orientation
de_de: Orientierung
ja_jp: 配置方向
ko_kr: 방향
ru_ru: Ориентация
zh_cn: 排列方式
zh_tw: 排列方式

source: Is Visible
de_de: Sichtbar
ja_jp: 表示するか
ko_kr: 표시 여부
ru_ru: Видимость
zh_cn: 是否可见
zh_tw: 是否可見

source: Font
de_de: Schrift
ja_jp: フォント
ko_kr: 글꼴
ru_ru: Шрифт
zh_cn: 字体
zh_tw: 字型

source: Major Grid Line
de_de: Hauptgitterlinie
ja_jp: 主グリッド線
ko_kr: 주 그리드 선
ru_ru: Основная сетка
zh_cn: 主网格线
zh_tw: 主網格線

source: Pattern
de_de: Muster
ja_jp: パターン
ko_kr: 패턴
ru_ru: Шаблон
zh_cn: 线型
zh_tw: 線型

source: Enable Anti-Alias
de_de: Anti-Aliasing aktivieren
ja_jp: アンチエイリアスを有効化
ko_kr: 앤티 앨리어싱 사용
ru_ru: Включить сглаживание
zh_cn: 启用抗锯齿
zh_tw: 啟用抗鋸齒

source: Background Fill
de_de: Hintergrundfüllung
ja_jp: 背景の塗りつぶし
ko_kr: 배경 채우기
ru_ru: Заливка фона
zh_cn: 背景填充
zh_tw: 背景填充

source: Enable Alternating Fill
de_de: Alternierende Füllung aktivieren
ja_jp: 交互塗りつぶしを有効化
ko_kr: 교차 채우기 사용
ru_ru: Включить чередующуюся заливку
zh_cn: 启用交替填充
zh_tw: 啟用交替填充

# background_fill_1
source: Background Fill
de_de: Hintergrundfüllung
ja_jp: 背景の塗りつぶし
ko_kr: 배경 채우기
ru_ru: Заливка фона
zh_cn: 背景填充
zh_tw: 背景填充

source: Fill Color 1
de_de: Füllfarbe 1
ja_jp: 塗りつぶし色 1
ko_kr: 채우기 색상 1
ru_ru: Цвет заливки 1
zh_cn: 填充颜色 1
zh_tw: 填充顏色 1

source: Fill Color 2
de_de: Füllfarbe 2
ja_jp: 塗りつぶし色 2
ko_kr: 채우기 색상 2
ru_ru: Цвет заливки 2
zh_cn: 填充颜色 2
zh_tw: 填充顏色 2

source: Coordinates
de_de: Koordinaten
ja_jp: 座標
ko_kr: 좌표
ru_ru: Координаты
zh_cn: 坐标
zh_tw: 座標

source: X Coordinate
de_de: X-Koordinate
ja_jp: X 座標
ko_kr: X 좌표
ru_ru: Координата X
zh_cn: X 坐标
zh_tw: X 座標

source: Y Coordinate
de_de: Y-Koordinate
ja_jp: Y 座標
ko_kr: Y 좌표
ru_ru: Координата Y
zh_cn: Y 坐标
zh_tw: Y 座標

source: Start and End Coordinates
de_de: Start- und Endkoordinaten
ja_jp: 開始座標
ko_kr: 시작 좌표
ru_ru: Начальные координаты
zh_cn: 起始坐标
zh_tw: 起始座標

source: Chart Title Style
de_de: Diagrammtitelstil
ja_jp: チャートタイトルのスタイル
ko_kr: 차트 제목 스타일
ru_ru: Стиль заголовка диаграммы
zh_cn: 图表标题样式
zh_tw: 圖表標題樣式

source: Is Bold
de_de: Fett
ja_jp: 太字
ko_kr: 굵게
ru_ru: Жирный
zh_cn: 粗体
zh_tw: 粗體

source: Is Italic
de_de: Kursiv
ja_jp: 斜体
ko_kr: 기울임꼴
ru_ru: Курсив
zh_cn: 斜体
zh_tw: 斜體

# background_fill_2
source: Background Fill
de_de: Hintergrundfüllung 2
ja_jp: 背景の塗りつぶし
ko_kr: 배경 채우기
ru_ru: Заливка фона
zh_cn: 背景填充
zh_tw: 背景填充

source: Minor Grid Line
de_de: Nebengitterlinie
ja_jp: 副グリッド線
ko_kr: 보조 그리드 선
ru_ru: Вспомогательная сетка
zh_cn: 次网格线
zh_tw: 次網格線

source: Open Diagram Template
de_de: Diagrammvorlage öffnen
ja_jp: 図解テンプレートを開く
ko_kr: 다이어그램 템플릿 열기
ru_ru: Открыть шаблон диаграммы
zh_cn: 打开图解模板
zh_tw: 開啟圖解範本

# new_version_available_github
source: New version found! Please go to the GitHub Release page to download the update.
de_de: Neue Version gefunden! Bitte laden Sie das Update von der GitHub Release-Seite herunter.
ja_jp: 新しいバージョンが見つかりました！GitHub Releaseページからダウンロードして更新してください。
ko_kr: 새 버전이 발견되었습니다! GitHub 릴리스 페이지로 이동하여 업데이트를 다운로드하십시오.
ru_ru: Найдена новая версия! Пожалуйста, скачайте обновление на странице релизов GitHub.
zh_cn: 发现新版本！请前往GitHub Release页面下载更新。
zh_tw: 發現新版本！請前往GitHub Release頁面下載更新。

source: Go to download
de_de: Zum Download
ja_jp: ダウンロードへ
ko_kr: 다운로드하러 가기
ru_ru: Скачать
zh_cn: 去下载
zh_tw: 去下載

source: Enter supported languages
de_de: Unterstützte Sprachen eingeben
ja_jp: サポート言語を入力
ko_kr: 지원되는 언어 입력
ru_ru: Введите поддерживаемые языки
zh_cn: 输入支持语言
zh_tw: 輸入支援語言

source: Delete this item
de_de: Dieses Element löschen
ja_jp: この項目を削除
ko_kr: 항목 삭제
ru_ru: Удалить этот элемент
zh_cn: 删除此项
zh_tw: 刪除此項

# enter_language_add
source: Enter a language and press Enter to add.
de_de: Sprache eingeben und Enter drücken.
ja_jp: 言語を入力してEnterキーを押すと追加されます。
ko_kr: 언어를 입력하고 Enter 키를 눌러 추가하십시오.
ru_ru: Введите язык и нажмите Enter для добавления.
zh_cn: 输入一个语言后按 Enter 键添加。
zh_tw: 輸入一個語言後按 Enter 鍵新增。

source: Enter category structure
de_de: Kategoriestruktur eingeben
ja_jp: カテゴリ構造を入力
ko_kr: 분류 구조 입력
ru_ru: Введите структуру категорий
zh_cn: 输入分类结构
zh_tw: 輸入分類結構

# enter_level_add
source: Enter a level and press Enter to add.
de_de: Ebene eingeben und Enter drücken.
ja_jp: レベルを入力してEnterキーを押すと追加されます。
ko_kr: 레벨을 입력하고 Enter 키를 눌러 추가하십시오.
ru_ru: Введите уровень и нажмите Enter для добавления.
zh_cn: 输入一个层级后按 Enter 键添加。
zh_tw: 輸入一個層級後按 Enter 鍵新增。

source: Plot type
de_de: Diagrammtyp
ja_jp: プロットタイプ
ko_kr: 플롯 유형
ru_ru: Тип графика
zh_cn: 绘图类型
zh_tw: 繪圖類型

source: Two-dimensional coordinate plot
de_de: 2D-Koordinatendiagramm
ja_jp: 2次元座標プロット
ko_kr: 2차원 좌표 플롯
ru_ru: 2D График
zh_cn: 二维坐标图
zh_tw: 二維座標圖

source: Template file save path
de_de: Speicherpfad der Vorlagendatei
ja_jp: テンプレートファイルの保存パス
ko_kr: 템플릿 파일 저장 경로
ru_ru: Путь сохранения файла шаблона
zh_cn: 模板文件保存路径
zh_tw: 範本檔案儲存路徑

# browse_ellipsis
source: Browse...
de_de: Durchsuchen...
ja_jp: 参照...
ko_kr: 찾아보기...
ru_ru: Обзор...
zh_cn: 浏览...
zh_tw: 瀏覽...

# all_fields_required
source: All fields are required!
de_de: Alle Felder sind erforderlich!
ja_jp: すべてのフィールドが必須です！
ko_kr: 모든 필드는 필수입니다!
ru_ru: Все поля обязательны!
zh_cn: 所有字段均为必填项！
zh_tw: 所有欄位均為必填項！

# category_structure_min_two
source: Category structure must be greater than or equal to 2!
de_de: Kategoriestruktur muss mindestens 2 Ebenen haben!
ja_jp: 分類構造は2以上である必要があります！
ko_kr: 분류 구조는 2 이상이어야 합니다!
ru_ru: Структура категорий должна быть >= 2!
zh_cn: 分类结构必须大于等于2！
zh_tw: 分類結構必須大於等於2！

# no_template_or_path_specified
source: No savable template or save path specified. Please use Save As to save.
de_de: Keine Vorlage oder Pfad angegeben. Bitte 'Speichern unter' verwenden.
ja_jp: 保存するテンプレートがないか、保存パスが指定されていません。「名前を付けて保存」を使用してください。
ko_kr: 저장할 템플릿이 없거나 저장 경로가 지정되지 않았습니다. '다른 이름으로 저장'을 사용하십시오.
ru_ru: Нет шаблона или не указан путь. Используйте "Сохранить как".
zh_cn: 没有可保存的模板或未指定保存路径。请使用另存为保存.
zh_tw: 沒有可儲存的範本或未指定儲存路徑。請使用另存新檔儲存.

source: Template saved successfully!
de_de: Vorlage erfolgreich gespeichert!
ja_jp: テンプレートが正常に保存されました！
ko_kr: 템플릿이 성공적으로 저장되었습니다!
ru_ru: Шаблон успешно сохранен!
zh_cn: 模板已成功保存！
zh_tw: 範本已成功儲存！

# save_template_failed
source: Failed to save template:
de_de: Speichern der Vorlage fehlgeschlagen:
ja_jp: テンプレートの保存に失敗しました:
ko_kr: 템플릿 저장 실패:
ru_ru: Ошибка сохранения шаблона:
zh_cn: 保存模板失败:
zh_tw: 儲存範本失敗:

# thank_you_and_wishes
source: Thank you for using! \n Wishing you
ja_jp: ご利用ありがとうございます🌹\n あなたの
zh_tw: 感謝您的使用🌹\n 祝您

# research_life_smooth_sailing
source: years of research, wishing you smooth sailing in life!
de_de: viel Erfolg in Forschung und Leben!
ja_jp: 研究生活が順風満帆でありますように！
ko_kr: 년간 연구와 생활이 순조롭기를 바랍니다!
ru_ru: успехов в исследованиях и гладкой жизни!
zh_cn: 年科研，生活一帆风顺！
zh_tw: 年科研，生活一帆風順！

source: Add
de_de: Hinzufügen
ja_jp: 追加
ko_kr: 추가
ru_ru: Добавить
zh_cn: 添加
zh_tw: 新增

source: Add line
de_de: Linie hinzufügen
ja_jp: 線を追加
ko_kr: 선 추가
ru_ru: Добавить линию
zh_cn: 添加线条
zh_tw: 新增線條

source: Add text
de_de: Text hinzufügen
ja_jp: テキストを追加
ko_kr: 텍스트 추가
ru_ru: Добавить текст
zh_cn: 添加文本
zh_tw: 新增文字

source: File
de_de: Datei
ja_jp: ファイル
ko_kr: 파일
ru_ru: Файл
zh_cn: 文件
zh_tw: 檔案

source: Template Loaded Successfully
de_de: Vorlage erfolgreich geladen
ja_jp: テンプレートファイルが開かれました
ko_kr: 템플릿 파일 열기 성공
ru_ru: Файл шаблона успешно открыт
zh_cn: 模板文件打开成功
zh_tw: 範本檔案開啟成功

# unknown_error_checking_for_updates
source: An unknown error occurred while checking for updates
de_de: Unbekannter Fehler bei der Update-Prüfung
ja_jp: 更新確認中に不明なエラーが発生しました
ko_kr: 업데이트 확인 중 알 수 없는 오류 발생
ru_ru: Неизвестная ошибка при проверке обновлений
zh_cn: 检查更新时发生未知错误
zh_tw: 檢查更新時發生未知錯誤

# already_latest_version
source: Already the latest version
de_de: Bereits die neueste Version
ja_jp: 既に最新バージョンです
ko_kr: 이미 최신 버전입니다
ru_ru: Уже установлена последняя версия
zh_cn: 当前已是最新版本
zh_tw: 目前已是最新版本

# cannot_parse_version_number_check_release_address
source: Unable to parse the version number. Please check the release address
de_de: Versionsnummer konnte nicht geparst werden. Bitte Release-Seite prüfen
ja_jp: バージョン番号を解析できません。リリース先を確認してください
ko_kr: 버전 번호를 구문 분석할 수 없습니다. 릴리스 주소에서 확인하십시오
ru_ru: Не удалось разобрать номер версии. Проверьте адрес релиза
zh_cn: 无法解析版本号。请前往发布地址查看
zh_tw: 無法解析版本號。請前往發布位址檢視

source: Network request error
de_de: Netzwerkanfragefehler
ja_jp: ネットワークリクエストエラー
ko_kr: 네트워크 요청 오류
ru_ru: Ошибка сетевого запроса
zh_cn: 网络请求错误
zh_tw: 網路請求錯誤

source: JSON parse error
de_de: JSON-Parse-Fehler
ja_jp: JSON 解析エラー
ko_kr: JSON 구문 분석 오류
ru_ru: Ошибка разбора JSON
zh_cn: JSON 解析错误
zh_tw: JSON 解析錯誤

# unknown_error_occurred
source: An unknown error occurred
de_de: Unbekannter Fehler aufgetreten
ja_jp: 不明なエラーが発生しました
ko_kr: 알 수 없는 오류 발생
ru_ru: Произошла неизвестная ошибка
zh_cn: 发生未知错误
zh_tw: 發生未知錯誤

source: Polygon
ja_jp: ポリゴン
ko_kr: 다각형
ru_ru: Полигон
zh_cn: 多边形
zh_tw: 多邊形

# not_enough_vertices_add_polygon_canceled
source: Not enough vertices, add polygon operation canceled.
de_de: Nicht genügend Eckpunkte, Polygon-Erstellung abgebrochen.
ja_jp: 頂点が不足しているため、ポリゴンの追加がキャンセルされました。
ko_kr: 정점 수가 부족하여 다각형 추가 작업이 취소되었습니다.
ru_ru: Недостаточно вершин, добавление полигона отменено.
zh_cn: 顶点数不足，添加多边形操作已取消.
zh_tw: 頂點數不足，新增多邊形操作已取消.

source: Add line operation canceled.
de_de: Linien-Erstellung abgebrochen.
ja_jp: 線の追加操作がキャンセルされました。
ko_kr: 선 추가 작업이 취소되었습니다.
ru_ru: Добавление линии отменено.
zh_cn: 添加线条操作已取消.
zh_tw: 新增線條操作已取消.

source: Add text operation canceled.
de_de: Text-Erstellung abgebrochen.
ja_jp: テキストの追加操作がキャンセルされました。
ko_kr: 텍스트 추가 작업이 취소되었습니다.
ru_ru: Добавление текста отменено.
zh_cn: 添加文本操作已取消.
zh_tw: 新增文字操作已取消.

# language_setting_duplicate_found
source: Duplicate items exist in language settings, please check!
de_de: Doppelte Einträge in den Spracheinstellungen gefunden, bitte prüfen!
ja_jp: 言語設定に重複項目があります。確認してください！
ko_kr: 언어 설정에 중복된 항목이 있습니다. 확인해 주십시오!
ru_ru: Найдены дубликаты в настройках языка, пожалуйста, проверьте!
zh_cn: 语言设置中存在重复项，请检查！
zh_tw: 語言設定中存在重複項，請檢查！

source: Add Polygon
de_de: Polygon hinzufügen
ja_jp: ポリゴンを追加
ko_kr: 다각형 추가
ru_ru: Добавить полигон
zh_cn: 添加多边形
zh_tw: 新增多邊形

# line_type_solid
source: Solid
de_de: Durchgezogen
ja_jp: 実線
ko_kr: 실선
ru_ru: Сплошная
zh_cn: 实线
zh_tw: 實線

# line_type_dash
source: Dash
de_de: Gestrichelt
ja_jp: 破線
ko_kr: 파선
ru_ru: Штриховая
zh_cn: 虚线
zh_tw: 虛線

# line_type_densely_dashed
source: DenselyDashed
de_de: Dicht gestrichelt
ja_jp: 密集破線
ko_kr: 촘촘한 파선
ru_ru: Частая штриховая
zh_cn: 密集虚线
zh_tw: 密集虛線

# line_type_dot
source: Dot
de_de: Gepunktet
ja_jp: 点線
ko_kr: 점선
ru_ru: Точечная
zh_cn: 点线
zh_tw: 點線

source: Ternary Phase Diagram
de_de: Ternäres Phasendiagramm
ja_jp: 三元相図
ko_kr: 삼원상 다이어그램
ru_ru: Тройная диаграмма
zh_cn: 三元相图
zh_tw: 三元相圖

# copy_plot_to_clipboard
source: Copy Plot Image to Clipboard
de_de: Diagramm in die Zwischenablage kopieren
ja_jp: プロット画像をクリップボードにコピー
ko_kr: 플롯 이미지를 클립보드로 복사
ru_ru: Скопировать график в буфер обмена
zh_cn: 复制绘图图像到剪切板
zh_tw: 複製繪圖影像到剪貼簿

# use_help
source: Diagram Guide
de_de: Diagramm-Anleitung
ja_jp: 図解ガイド
ko_kr: 다이어그램 가이드
ru_ru: Руководство по диаграммам
zh_cn: 图解指南
zh_tw: 圖解指南

source: No data, please add data
de_de: Keine Daten, bitte Daten hinzufügen
ja_jp: データがありません。データを追加してください
ko_kr: 데이터 없음, 데이터를 추가하십시오
ru_ru: Нет данных, пожалуйста, добавьте данные
zh_cn: 无数据，请添加数据
zh_tw: 無資料，請新增資料

source: No data columns defined
de_de: Keine Datenspalten definiert
ja_jp: データ列が定義されていません
ko_kr: 데이터 열이 정의되지 않음
ru_ru: Столбцы данных не определены
zh_cn: 未定义数据列
zh_tw: 未定義資料欄

source: Data plotting successful
de_de: Datenpunkte erfolgreich gezeichnet
ja_jp: データポイントの描画に成功しました
ko_kr: 데이터 포인트 플롯 성공
ru_ru: Точки данных успешно построены
zh_cn: 数据点绘图成功
zh_tw: 資料點繪圖成功

source: Save as CSV File
de_de: Als CSV speichern
ja_jp: CSVファイルとして保存
ko_kr: CSV 파일로 저장
ru_ru: Сохранить как CSV
zh_cn: 保存为CSV文件
zh_tw: 儲存為CSV檔案

# csv_file_filter
source: CSV File|*.csv
de_de: CSV-Datei|*.csv
ja_jp: CSVファイル|*.csv
ko_kr: CSV 파일|*.csv
ru_ru: Файл CSV|*.csv
zh_cn: CSV文件|*.csv
zh_tw: CSV檔案|*.csv

source: Data Export
de_de: Datenexport
ja_jp: データのエクスポート
ko_kr: 데이터 내보내기
ru_ru: Экспорт данных
zh_cn: 数据导出
zh_tw: 資料匯出

source: Update Data
de_de: Daten aktualisieren
ja_jp: データを更新
ko_kr: 데이터 업데이트
ru_ru: Обновить данные
zh_cn: 更新数据
zh_tw: 更新資料

source: Data Plotting
de_de: Daten plotten
ja_jp: データをプロット
ko_kr: 데이터 플롯
ru_ru: Построить точки
zh_cn: 数据投点
zh_tw: 資料投點

# highlight_on_hover
source: When enabled, hovering the mouse over a plot object (point, line, area, etc.) will automatically highlight it, and you can click to view information
de_de: Wenn aktiviert, werden Elemente beim Überfahren hervorgehoben und Details beim Klicken angezeigt
ja_jp: 有効にすると、マウスを描画オブジェクト（点、線、面など）の上に置いたときに自動的にハイライトされ、クリックして情報を表示できます
ko_kr: 활성화하면 마우스가 플롯 개체(점, 선, 면 등) 위로 이동할 때 자동으로 강조 표시되며 클릭하여 정보를 볼 수 있습니다
ru_ru: При включении, объекты под курсором будут подсвечиваться, кликните для информации
zh_cn: 开启后，鼠标移到绘图对象（点、线、面等）上方时会自动高亮，点击可查看信息
zh_tw: 開啟後，滑鼠移到繪圖物件（點、線、面等）上方時會自動高亮，點擊可檢視資訊

# count
source: Number of minor ticks
de_de: Anzahl
ja_jp: 副目盛の数
ko_kr: 보조 눈금 수
ru_ru: Количество
zh_cn: 次刻度数量
zh_tw: 次刻度數量

source: Zoom Type
de_de: Zoomtyp
ja_jp: ズームタイプ
ko_kr: 줌 유형
ru_ru: Тип масштабирования
zh_cn: 缩放类型
zh_tw: 縮放類型

source: From
de_de: Von
ja_jp: 開始
ko_kr: 시작
ru_ru: От
zh_cn: 从
zh_tw: 從

source: To
de_de: Bis
ja_jp: 終了
ko_kr: 끝
ru_ru: До
zh_cn: 到
zh_tw: 到

# ternary_phase_diagram_sum_must_be_one
source: The sum of a ternary phase diagram must be 1.
de_de: Summe im ternären Diagramm muss 1 sein.
ja_jp: 三元相図の合計は 1 でなければなりません。
ko_kr: 삼원상 다이어그램의 합은 1이어야 합니다.
ru_ru: Сумма тройной диаграммы должна быть равна 1.
zh_cn: 三元相图之和必须为 1.
zh_tw: 三元相圖之和必須為 1.

source: Save as
de_de: Speichern unter
ja_jp: 名前を付けて保存
ko_kr: 다른 이름으로 저장
ru_ru: Сохранить как
zh_cn: 另存为
zh_tw: 另存新檔

source: All data cleared
de_de: Alle Daten gelöscht
ja_jp: すべてのデータがクリアされました
ko_kr: 모든 데이터가 지워짐
ru_ru: Все данные очищены
zh_cn: 所有数据已清除
zh_tw: 所有資料已清除

# confirm_clear_all_data
source: Clear table data (including plot data points)?
de_de: Alle Tabellendaten löschen (inkl. Plot-Punkte)?
ja_jp: テーブルデータ（描画データポイントを含む）をクリアしてもよろしいですか？
ko_kr: 테이블 데이터(플롯 데이터 포인트 포함)를 지우시겠습니까?
ru_ru: Очистить данные таблицы (включая точки графика)?
zh_cn: 是否清除表格数据（包括绘图数据点）？
zh_tw: 是否清除表格資料（包括繪圖資料點）？

source: Clear Data Points
de_de: Datenpunkte löschen
ja_jp: データポイントをクリア
ko_kr: 데이터 포인트 지우기
ru_ru: Очистить точки данных
zh_cn: 清除数据点
zh_tw: 清除資料點

source: Linear
ja_jp: 線形
ko_kr: 선형
ru_ru: Линейный
zh_cn: 线性
zh_tw: 線性

source: Logarithmic
de_de: Logarithmisch
ja_jp: 対数
ko_kr: 로그
ru_ru: Логарифмический
zh_cn: 对数
zh_tw: 對數

# some_data_failed_validation
source: Some data failed validation and has been skipped for plotting
de_de: Einige Daten haben die Validierung nicht bestanden und wurden übersprungen
ja_jp: 一部のデータが検証に合格しなかったため、描画をスキップしました
ko_kr: 일부 데이터가 유효성 검사를 통과하지 못해 건너뛰었습니다
ru_ru: Некоторые данные не прошли проверку, пропущены
zh_cn: 部分数据未通过校验，已跳过绘制
zh_tw: 部分資料未通過校驗，已跳過繪製

source: The sum of row
de_de: Zeile
ja_jp: 第
ko_kr: 제
ru_ru: Сумма строки
zh_cn: 第
zh_tw: 第

# is_not_one
source: is not 1
de_de: Datensumme ist nicht 1
ja_jp: 行のデータの合計が1ではありません
ko_kr: 행 데이터의 합이 1이 아님
ru_ru: не равна 1
zh_cn: 条数据和不为1
zh_tw: 條資料和不為1

# actual_sum_is
source: (actual sum
de_de: (Tatsächliche Summe
ja_jp: (実際の合計:
ko_kr: (실제 합계
ru_ru: (Фактическая сумма
zh_cn: (实际和为
zh_tw: (實際和為

source: Arrow
de_de: Pfeil
ja_jp: 矢印
ko_kr: 화살표
ru_ru: Стрелка
zh_cn: 箭头
zh_tw: 箭頭

source: Arrow Head Width
de_de: Pfeilspitzenbreite
ja_jp: 矢印の幅
ko_kr: 화살표 머리 너비
ru_ru: Ширина стрелки
zh_cn: 箭头宽度
zh_tw: 箭頭寬度

source: Arrow Head Length
de_de: Pfeilspitzenlänge
ja_jp: 矢印の長さ
ko_kr: 화살표 머리 길이
ru_ru: Длина стрелки
zh_cn: 箭头长度
zh_tw: 箭頭長度

source: Add Arrow
de_de: Pfeil hinzufügen
ja_jp: 矢印を追加
ko_kr: 화살표 추가
ru_ru: Добавить стрелку
zh_cn: 添加箭头
zh_tw: 新增箭頭

source: Delete Object
de_de: Objekt löschen
ja_jp: オブジェクトを削除
ko_kr: 개체 삭제
ru_ru: Удалить объект
zh_cn: 删除对象
zh_tw: 刪除物件

source: Please select an object to delete first.
de_de: Bitte zuerst ein Objekt zum Löschen auswählen.
ja_jp: 削除するオブジェクトを先に選択してください。
ko_kr: 먼저 삭제할 개체를 선택하십시오.
ru_ru: Пожалуйста, выберите объект для удаления.
zh_cn: 请先选择一个要删除的对象.
zh_tw: 請先選擇一個要刪除的物件.

source: Object deleted successfully.
de_de: Objekt erfolgreich gelöscht.
ja_jp: オブジェクトが正常に削除されました。
ko_kr: 개체가 성공적으로 삭제되었습니다.
ru_ru: Объект успешно удален.
zh_cn: 对象已成功删除.
zh_tw: 物件已成功刪除.

source: Cannot delete base layers.
de_de: Basisebenen können nicht gelöscht werden.
ja_jp: ベースレイヤーは削除できません。
ko_kr: 기본 레이어를 삭제할 수 없습니다.
ru_ru: Невозможно удалить базовые слои.
zh_cn: 无法删除基础图层.
zh_tw: 無法刪除基礎圖層.

# update
source: _Update(U)
de_de: _Aktualisieren(T)
ja_jp: 更新(_T)
ko_kr: 업데이트(_T)
ru_ru: _Обновить(T)
zh_cn: _更新(U)
zh_tw: _更新(T)

source: Check for Template Updates
de_de: Auf Vorlagenupdates prüfen
ja_jp: テンプレートの更新を確認
ko_kr: 템플릿 업데이트 확인
ru_ru: Проверить обновления шаблонов
zh_cn: 检查模板更新
zh_tw: 檢查範本更新

source: Template Ready!
de_de: Vorlage bereit!
ja_jp: テンプレートの準備ができました！
ko_kr: 템플릿 준비 완료!
ru_ru: Шаблон готов!
zh_cn: 模板就绪！
zh_tw: 範本就緒！

source: Download Template Failed:
de_de: Vorlagendownload fehlgeschlagen:
ja_jp: テンプレートのダウンロードに失敗しました:
ko_kr: 템플릿 다운로드 실패:
ru_ru: Ошибка загрузки шаблона:
zh_cn: 下载模板失败:
zh_tw: 下載範本失敗:

# downloaded_file_hash_mismatch
source: The downloaded file hash does not match the server's. The file may be corrupt or tampered with.
de_de: Hash-Mismatch der heruntergeladenen Datei, Datei könnte beschädigt oder manipuliert sein.
ja_jp: ダウンロードされたファイルのハッシュ値がサーバーと一致しません。ファイルが破損しているか、改ざんされている可能性があります。
ko_kr: 다운로드한 파일 해시가 서버와 일치하지 않습니다. 파일이 손상되었거나 변조되었을 수 있습니다.
ru_ru: Хэш скачанного файла не совпадает, файл может быть поврежден.
zh_cn: 下载的文件哈希值与服务器不匹配，文件可能已损坏或遭到篡改。
zh_tw: 下載的檔案雜湊值與伺服器不匹配，檔案可能已損壞或遭到篡改。

# downloaded_content_not_valid_json
source: The downloaded content is not in a valid JSON format.
de_de: Heruntergeladener Inhalt ist kein gültiges JSON-Format.
ja_jp: ダウンロードされたコンテンツは有効なJSON形式ではありません。
ko_kr: 다운로드한 내용이 유효한 JSON 형식이 아닙니다.
ru_ru: Скачанное содержимое не является допустимым JSON.
zh_cn: 下载的内容不是有效的 JSON 格式。
zh_tw: 下載的內容不是有效的 JSON 格式。

# template_list_update_success_refreshing
source: Template list updated successfully! Refreshing...
de_de: Vorlagenliste erfolgreich aktualisiert! Wird neu geladen...
ja_jp: テンプレートリストが更新されました！更新中...
ko_kr: 템플릿 목록 업데이트 성공! 새로 고치는 중...
ru_ru: Список шаблонов обновлен! Обновление...
zh_cn: 模板列表更新成功！正在刷新...
zh_tw: 範本列表更新成功！正在重新整理...

# update_list_file_failed
source: Failed to Update List File
de_de: Aktualisierung der Listendatei fehlgeschlagen
ja_jp: リストファイルの更新に失敗しました
ko_kr: 목록 파일 업데이트 실패
ru_ru: Ошибка обновления файла списка
zh_cn: 更新列表文件失败
zh_tw: 更新列表檔案失敗

# new_drawing_template_library_version_detected
source: A new version of the drawing template library has been detected. Do you want to update the list now?
de_de: Neue Version der Zeichenvorlagenbibliothek erkannt. Jetzt aktualisieren?
ja_jp: 描画テンプレートライブラリの新しいバージョンが検出されました。リストを今すぐ更新しますか？
ko_kr: 드로잉 템플릿 라이브러리의 새 버전이 감지되었습니다. 목록을 지금 업데이트하시겠습니까?
ru_ru: Обнаружена новая версия библиотеки шаблонов, обновить список?
zh_cn: 检测到绘图模板库有新版本，是否立即更新列表？
zh_tw: 檢測到繪圖範本庫有新版本，是否立即更新列表？

# current_template_list_latest_version
source: The current template list is already the latest version.
de_de: Die aktuelle Vorlagenliste ist bereits die neueste Version.
ja_jp: 現在のテンプレートリストは最新です。
ko_kr: 현재 템플릿 목록은 최신 버전입니다.
ru_ru: Текущий список шаблонов актуален.
zh_cn: 当前模板列表已是最新版本。
zh_tw: 目前範本列表已是最新版本。

source: Network connection failed, cannot check for updates:
de_de: Netzwerkverbindung fehlgeschlagen, Updates können nicht geprüft werden:
ja_jp: ネットワーク接続に失敗したため、更新を確認できません:
ko_kr: 네트워크 연결 실패, 업데이트를 확인할 수 없음:
ru_ru: Ошибка сети, невозможно проверить обновления：
zh_cn: 网络连接失败，无法检查更新：
zh_tw: 網路連線失敗，無法檢查更新：

# error_occurred_while_checking_for_updates
source: An error occurred while checking for updates:
de_de: Fehler beim Prüfen auf Updates:
ja_jp: 更新確認中にエラーが発生しました:
ko_kr: 업데이트 확인 중 오류 발생：
ru_ru: Ошибка при проверке обновлений：
zh_cn: 检查更新时发生错误：
zh_tw: 檢查更新時發生錯誤：

source: Help Instructions
de_de: Hilfeanweisungen
ja_jp: ヘルプの説明
ko_kr: 도움말
ru_ru: Инструкции
zh_cn: 帮助说明
zh_tw: 幫助說明

# view_help_docs
source: View Help Documentation
de_de: Hilfedokumentation anzeigen
ja_jp: ヘルプドキュメントを表示
ko_kr: 도움말 문서 보기
ru_ru: Смотреть документацию
zh_cn: 查看帮助文档
zh_tw: 檢視幫助文件

source: Custom Templates
de_de: Benutzerdefinierte Vorlagen
ja_jp: カスタムテンプレート
ko_kr: 사용자 정의 템플릿
ru_ru: Пользовательские шаблоны
zh_cn: 个人图解模板
zh_tw: 自訂範本

source: Check for Category Updates
de_de: Nach Kategoriestruktur-Updates suchen
ja_jp: カテゴリ構造の更新を確認
ko_kr: 분류 구조 업데이트 확인
ru_ru: Проверить обновления категорий
zh_cn: 检查分类结构更新
zh_tw: 檢查分類結構更新

source: Cannot delete protected column
de_de: Geschützte Spalte kann nicht gelöscht werden
ja_jp: 保護された列は削除できません
ko_kr: 보호된 열을 삭제할 수 없음
ru_ru: Невозможно удалить защищенный столбец
zh_cn: 无法删除受保护的列
zh_tw: 無法刪除受保護的欄

source: Add Column (Left)
de_de: Spalte links hinzufügen
ja_jp: 列を追加 (左)
ko_kr: 열 추가(왼쪽)
ru_ru: Добавить столбец (слева)
zh_cn: 添加列(左)
zh_tw: 新增欄(左)

source: Add Column (Right)
de_de: Spalte rechts hinzufügen
ja_jp: 列を追加 (右)
ko_kr: 열 추가(오른쪽)
ru_ru: Добавить столбец (справа)
zh_cn: 添加列(右)
zh_tw: 新增欄(右)

source: Delete Row
de_de: Zeile löschen
ja_jp: 行を削除
ko_kr: 행 삭제
ru_ru: Удалить строку
zh_cn: 删除行
zh_tw: 刪除列

source: Delete Column
de_de: Spalte löschen
ja_jp: 列を削除
ko_kr: 열 삭제
ru_ru: Удалить столбец
zh_cn: 删除列
zh_tw: 刪除欄

source: Missing Columns
de_de: Fehlende Spalten
ja_jp: 列が不足しています
ko_kr: 누락된 열
ru_ru: Отсутствуют столбцы
zh_cn: 缺少列
zh_tw: 缺少欄

# add_row_up
source: Add Row Above
de_de: Zeile oben einfügen
ja_jp: 上に行を挿入
ko_kr: 위에 행 삽입
ru_ru: Вставить строку сверху
zh_cn: 上方插入行
zh_tw: 上方插入列
