Repository: MaxwellLei/GeoChemistry-Nexus
Catalog: src/Data/Language/Language.*.resx
Languages: de_de, ja_jp, ko_kr, ru_ru, zh_cn, zh_tw

# add_row_down
source: Add Row Below
de_de: Zeile unten einfügen
ja_jp: 下に行を挿入
ko_kr: 아래에 행 삽입
ru_ru: Вставить строку снизу
zh_cn: 下方插入行
zh_tw: 下方插入列

# confirm_delete_row
source: Are you sure you want to delete the selected row(s)?
de_de: Ausgewählte Zeile(n) wirklich löschen?
ja_jp: 選択した行を削除してもよろしいですか？
ko_kr: 선택한 행을 삭제하시겠습니까?
ru_ru: Удалить выбранные строки?
zh_cn: 确定要删除选中的行吗？
zh_tw: 確定要刪除選中的列嗎？

# confirm_delete_column
source: Are you sure you want to delete the selected column(s)?
de_de: Ausgewählte Spalte(n) wirklich löschen?
ja_jp: 選択した列を削除してもよろしいですか？
ko_kr: 선택한 열을 삭제하시겠습니까?
ru_ru: Удалить выбранные столбцы?
zh_cn: 确定要删除选中的列吗？
zh_tw: 確定要刪除選中的欄嗎？

source: Axis
de_de: Achse
ja_jp: 座標軸
ko_kr: 좌표축
ru_ru: Ось
zh_cn: 坐标轴
zh_tw: 座標軸

source: Grid
de_de: Gitter
ja_jp: グリッド
ko_kr: 그리드
ru_ru: Сетка
zh_cn: 网格
zh_tw: 網格

source: Formula
de_de: Formel
ja_jp: 数式
ko_kr: 공식
ru_ru: Формула
zh_cn: 公式
zh_tw: 公式

source: Range
de_de: Bereich
ja_jp: 範囲
ko_kr: 범위
ru_ru: Диапазон
zh_cn: 范围
zh_tw: 範圍

source: Domain
de_de: Definitionsbereich
ja_jp: 定義域
ko_kr: 정의역
ru_ru: Область определения
zh_cn: 定义域
zh_tw: 定義域

# point_count
source: Sampling point
de_de: Stützstellen
ja_jp: サンプリング点
ko_kr: 샘플 포인트
ru_ru: Количество точек
zh_cn: 采样点
zh_tw: 取樣點

source: Vertices
de_de: Eckpunkte
ja_jp: 頂点
ko_kr: 정점
ru_ru: Вершины
zh_cn: 顶点
zh_tw: 頂點

# template_file_corrupted
source: Template file is corrupted
de_de: Vorlagendatei ist beschädigt
ja_jp: テンプレートファイルが破損しています
ko_kr: 템플릿 파일이 손상됨
ru_ru: Файл шаблона поврежден
zh_cn: 模板文件已损坏
zh_tw: 範本檔案已損壞

# template_version_too_high
source: Template version is higher than current software version. Please upgrade software to open.
de_de: Vorlagenversion ist höher als die aktuelle Softwareversion. Bitte Software aktualisieren.
ja_jp: テンプレートのバージョンが現在のソフトウェアバージョンより高いため、ソフトウェアをアップグレードして開いてください。
ko_kr: 템플릿 버전이 현재 소프트웨어 버전보다 높습니다. 소프트웨어를 업그레이드한 후 여십시오.
ru_ru: Версия шаблона выше текущей версии ПО, пожалуйста, обновитесь.
zh_cn: 模板版本高于当前软件版本，请升级软件后打开.
zh_tw: 範本版本高於目前軟體版本，請升級軟體後開啟.

source: Error loading template
de_de: Fehler beim Laden der Vorlage
ja_jp: テンプレートの読み込み中にエラーが発生しました
ko_kr: 템플릿 로드 중 오류 발생
ru_ru: Ошибка загрузки шаблона
zh_cn: 加载模板时发生错误
zh_tw: 載入範本時發生錯誤

# template_upgrade_warning
source: The current template version is older. Saving will upgrade the template version, which may make it unusable in older versions of the software. Continue?
de_de: Die aktuelle Vorlagenversion ist älter. Speichern aktualisiert die Version, was die Kompatibilität mit älteren Softwareversionen beeinträchtigen kann. Fortfahren?
ja_jp: 現在のテンプレートバージョンは古いです。保存するとバージョンがアップグレードされ、古いバージョンのソフトウェアでは使用できなくなる可能性があります。続行しますか？
ko_kr: 현재 템플릿 버전이 낮습니다. 저장하면 템플릿 버전이 업그레이드되어 하위 버전의 소프트웨어에서 이 템플릿을 사용하지 못할 수 있습니다. 계속하시겠습니까?
ru_ru: Версия шаблона устарела, сохранение обновит её. Продолжить?
zh_cn: 当前模板版本较低，保存后将升级模板版本，可能会导致低版本软件无法使用该模板。是否继续？
zh_tw: 目前範本版本較低，儲存後將升級範本版本，可能會導致低版本軟體無法使用該範本。是否繼續？

source: Offset
de_de: Versatz
ja_jp: オフセット
ko_kr: 오프셋
ru_ru: Смещение
zh_cn: 偏移量
zh_tw: 偏移量

source: Offset X
de_de: Versatz X
ja_jp: オフセット X
ko_kr: 오프셋 X
ru_ru: Смещение X
zh_cn: 偏移量 X
zh_tw: 偏移量 X

source: Offset Y
de_de: Versatz Y
ja_jp: オフセット Y
ko_kr: 오프셋 Y
ru_ru: Смещение Y
zh_cn: 偏移量 Y
zh_tw: 偏移量 Y

source: Add Function
de_de: Funktion hinzufügen
ja_jp: 関数を追加
ko_kr: 함수 추가
ru_ru: Добавить функцию
zh_cn: 添加函数
zh_tw: 新增函數

# Placeholder_Text
source: Enter Text
de_de: Bitte Text eingeben
ja_jp: テキストを入力してください
ko_kr: 텍스트를 입력하십시오
ru_ru: Введите текст
zh_cn: 请输入文本
zh_tw: 請輸入文字

# Placeholder_Axis_Title
source: Axis Title
de_de: Achsentitel
ja_jp: 軸タイトル
ko_kr: 축 제목
ru_ru: Заголовок оси
zh_cn: 轴标题
zh_tw: 軸標題

# Placeholder_Chart_Title
source: Chart Title
de_de: Diagrammtitel
ja_jp: チャートタイトル
ko_kr: 차트 제목
ru_ru: Заголовок диаграммы
zh_cn: 图表标题
zh_tw: 圖表標題

# Placeholder_Ternary_Title
source: New Ternary Plot
de_de: Neues ternäres Phasendiagramm
ja_jp: 新規三元相図
ko_kr: 새 삼원상 다이어그램
ru_ru: Новая тройная диаграмма
zh_cn: 新建三元相图
zh_tw: 新增三元相圖

# Placeholder_Chart_Title_Default
source: New Chart
de_de: Neues Diagramm
ja_jp: 新規チャート
ko_kr: 새 차트
ru_ru: Новая диаграмма
zh_cn: 新建图表
zh_tw: 新增圖表

# Placeholder_Axis_X
source: X-Axis
de_de: X-Achse
ja_jp: X軸
ko_kr: X축
ru_ru: Ось X
zh_cn: X轴
zh_tw: X軸

# Placeholder_Axis_Y
source: Y-Axis
de_de: Y-Achse
ja_jp: Y軸
ko_kr: Y축
ru_ru: Ось Y
zh_cn: Y轴
zh_tw: Y軸

source: Third-party
de_de: Drittanbieter
ja_jp: サードパーティ
ko_kr: 타사
ru_ru: Стороннее ПО
zh_cn: 第三方
zh_tw: 第三方

source: Open via third-party
de_de: Über Drittanbieter öffnen
ja_jp: サードパーティで開く
ko_kr: 타사 앱으로 열기
ru_ru: Открыть через стороннее ПО
zh_cn: 通过第三方打开
zh_tw: 通過第三方開啟

# select_an_object
source: Please select an object
de_de: Bitte ein Objekt auswählen
ja_jp: オブジェクトを選択してください
ko_kr: 개체를 선택하십시오
ru_ru: Выберите объект
zh_cn: 请选择一个对象
zh_tw: 請選擇一個物件

source: Undo
de_de: Rückgängig
ja_jp: 元に戻す
ko_kr: 실행 취소
ru_ru: Отменить
zh_cn: 撤回
zh_tw: 復原

source: Redo
de_de: Wiederholen
ja_jp: やり直し
ko_kr: 다시 실행
ru_ru: Повторить
zh_cn: 重做
zh_tw: 重做

source: Interval
de_de: Skalenintervall
ja_jp: 目盛の間隔
ko_kr: 눈금 간격
ru_ru: Шаг деления
zh_cn: 刻度步长
zh_tw: 刻度間隔

# pick_coordinate
source: Pick Coordinates
de_de: Koordinate wählen
ja_jp: 座標をピック
ko_kr: 좌표 선택
ru_ru: Взять координаты
zh_cn: 拾取坐标
zh_tw: 拾取座標

# remove_point
source: Delete this vertex
de_de: Diesen Eckpunkt entfernen
ja_jp: この頂点を削除
ko_kr: 이 정점 삭제
ru_ru: Удалить вершину
zh_cn: 删除此顶点
zh_tw: 刪除此頂點

# vertex_add_new
source: Add new vertex
de_de: Neuen Eckpunkt hinzufügen
ja_jp: 新しい頂点を追加
ko_kr: 새 정점 추가
ru_ru: Добавить вершину
zh_cn: 添加新顶点
zh_tw: 新增新頂點

source: Subtitle
de_de: Untertitel
ja_jp: サブタイトル
ko_kr: 부제목
ru_ru: Подзаголовок
zh_cn: 子标题
zh_tw: 副標題

# subtitle_font_size
source: Subtitle Size
de_de: Untertitel-Schriftgröße
ja_jp: サブタイトルのフォントサイズ
ko_kr: 부제목 글꼴 크기
ru_ru: Размер шрифта подзаголовка
zh_cn: 子标题字号
zh_tw: 副標題字號

source: Subtitle Color
de_de: Untertitel-Farbe
ja_jp: サブタイトルの色
ko_kr: 부제목 색상
ru_ru: Цвет подзаголовка
zh_cn: 子标题颜色
zh_tw: 副標題顏色

source: Subtitle Bold
de_de: Untertitel fett
ja_jp: サブタイトル太字
ko_kr: 부제목 굵게
ru_ru: Жирный подзаголовок
zh_cn: 子标题粗体
zh_tw: 副標題粗體

source: Subtitle Italic
de_de: Untertitel kursiv
ja_jp: サブタイトル斜体
ko_kr: 부제목 기울임꼴
ru_ru: Курсив подзаголовка
zh_cn: 子标题斜体
zh_tw: 副標題斜體

source: Edit link
de_de: Link bearbeiten
ja_jp: リンクを編集
ko_kr: 링크 편집
ru_ru: Редактировать ссылку
zh_cn: 编辑链接
zh_tw: 編輯連結

# template_translator
source: Diagram Template Translator
de_de: Vorlagenübersetzer
ja_jp: 図解テンプレート翻訳機
ko_kr: 다이어그램 템플릿 번역기
ru_ru: Переводчик шаблонов
zh_cn: 图解模板翻译器
zh_tw: 圖解範本翻譯器

source: Diagram Template Repair Tool
de_de: Vorlagenreparaturtool
ja_jp: 図解テンプレート修復ツール
ko_kr: 다이어그램 템플릿 복구 도구
ru_ru: Инструмент восстановления шаблонов
zh_cn: 图解模板修复工具
zh_tw: 圖解範本修復工具

source: Server Announcement
de_de: Serverankündigung
ja_jp: サーバーからのお知らせ
ko_kr: 서버 공지
ru_ru: Объявление сервера
zh_cn: 服务器公告
zh_tw: 伺服器公告

source: Developer Maintenance Tool
de_de: Entwicklerwartungstool
ja_jp: 開発者メンテナンスツール
ko_kr: 개발자 유지 관리 도구
ru_ru: Инструменты разработчика
zh_cn: 开发者维护工具
zh_tw: 開發者維護工具

source: Copy Content
de_de: Inhalt kopieren
ja_jp: コンテンツをコピー
ko_kr: 내용 복사
ru_ru: Копировать содержимое
zh_cn: 复制内容
zh_tw: 複製內容

# modified_successfully
source: Modified
de_de: Erfolgreich geändert
ja_jp: 変更されました
ko_kr: 수정됨
ru_ru: Изменено
zh_cn: 已修改
zh_tw: 已修改

source: Error loading RTF file:
de_de: Fehler beim Laden der RTF-Datei:
ja_jp: RTFファイルの読み込み中にエラーが発生しました:
ko_kr: RTF 파일 로드 중 오류 발생:
ru_ru: Ошибка загрузки RTF:
zh_cn: 加载RTF文件时出错:
zh_tw: 載入RTF檔案時出錯:

source: File path cannot be empty
de_de: Dateipfad darf nicht leer sein
ja_jp: ファイルパスを空にすることはできません
ko_kr: 파일 경로는 비어 있을 수 없습니다
ru_ru: Путь не может быть пустым
zh_cn: 文件路径不能为空
zh_tw: 檔案路徑不能為空

source: RichTextBox control cannot be null
de_de: RichTextBox-Steuerelement darf nicht null sein
ja_jp: RichTextBoxコントロールをnullにすることはできません
ko_kr: RichTextBox 컨트롤은 null일 수 없습니다
ru_ru: RichTextBox не может быть null
zh_cn: RichTextBox控件不能为null
zh_tw: RichTextBox控制項不能為null

source: File does not exist:
de_de: Datei existiert nicht:
ja_jp: ファイルが存在しません:
ko_kr: 파일이 존재하지 않음:
ru_ru: Файл не существует:
zh_cn: 文件不存在:
zh_tw: 檔案不存在:

source: Error saving RTF file:
de_de: Fehler beim Speichern der RTF-Datei:
ja_jp: RTFファイルの保存中にエラーが発生しました:
ko_kr: RTF 파일 저장 중 오류 발생:
ru_ru: Ошибка сохранения RTF:
zh_cn: 保存RTF文件时出错:
zh_tw: 儲存RTF檔案時出錯:

# unable_to_get_latest_release_info
source: Unable to get latest release information
de_de: Neueste Release-Info nicht abrufbar
ja_jp: 最新のリリース情報を取得できません
ko_kr: 최신 릴리스 정보를 가져올 수 없음
ru_ru: Не удалось получить информацию о последней версии
zh_cn: 无法获取最新发布版本信息
zh_tw: 無法取得最新發布版本資訊

source: Invalid formula
de_de: Ungültige Formel
ja_jp: 数式が無効です
ko_kr: 유효하지 않은 공식
ru_ru: Неверная формула
zh_cn: 公式不合法
zh_tw: 公式不合法

source: Loading announcements...
de_de: Lade Ankündigungen...
ja_jp: お知らせを読み込み中...
ko_kr: 공지 로드 중...
ru_ru: Загрузка объявлений...
zh_cn: 正在加载公告...
zh_tw: 正在載入公告...

# no_announcements
source: No announcements available.
de_de: Keine Ankündigungen.
ja_jp: お知らせはありません。
ko_kr: 공지 없음.
ru_ru: Нет объявлений.
zh_cn: 暂无公告。
zh_tw: 暫無公告。

# unable_to_get_announcements
source: Unable to get announcement information.
de_de: Ankündigungen nicht abrufbar.
ja_jp: お知らせ情報を取得できません。
ko_kr: 공지 정보를 가져올 수 없음.
ru_ru: Не удалось получить объявления.
zh_cn: 无法获取公告信息。
zh_tw: 無法取得公告資訊。

source: Failed to get announcements:
de_de: Abrufen der Ankündigungen fehlgeschlagen:
ja_jp: お知らせの取得に失敗しました:
ko_kr: 공지 가져오기 실패:
ru_ru: Ошибка получения объявлений:
zh_cn: 获取公告失败:
zh_tw: 取得公告失敗:

source: Error loading template list:
de_de: Fehler beim Laden der Vorlagenliste:
ja_jp: テンプレートリストの読み込みエラー:
ko_kr: 템플릿 목록 로드 오류:
ru_ru: Ошибка загрузки списка шаблонов:
zh_cn: 加载模板列表出错:
zh_tw: 載入範本列表出錯:

source: Unable to open link:
de_de: Link kann nicht geöffnet werden:
ja_jp: リンクを開けません:
ko_kr: 링크를 열 수 없음:
ru_ru: Невозможно открыть ссылку:
zh_cn: 无法打开链接:
zh_tw: 無法開啟連結:

source: Add Link
de_de: Link hinzufügen
ja_jp: リンクを追加
ko_kr: 링크 추가
ru_ru: Добавить ссылку
zh_cn: 添加链接
zh_tw: 新增連結

source: Name
ja_jp: 名前
ko_kr: 이름
ru_ru: Имя
zh_cn: 名称
zh_tw: 名稱

source: Link (URL)
ja_jp: リンク (URL)
ko_kr: 링크 (URL)
ru_ru: Ссылка (URL)
zh_cn: 链接 (URL)
zh_tw: 連結 (URL)

source: Description
de_de: Beschreibung
ja_jp: 説明
ko_kr: 설명
ru_ru: Описание
zh_cn: 描述
zh_tw: 描述

source: Icon
ja_jp: アイコン
ko_kr: 아이콘
ru_ru: Иконка
zh_cn: 图标
zh_tw: 圖示

# please_enter_name
source: Please enter a name
de_de: Bitte Name eingeben
ja_jp: 名前を入力してください
ko_kr: 이름을 입력하십시오
ru_ru: Введите имя
zh_cn: 请输入名称
zh_tw: 請輸入名稱

# please_enter_link
source: Please enter a link
de_de: Bitte Link eingeben
ja_jp: リンクを入力してください
ko_kr: 링크를 입력하십시오
ru_ru: Введите ссылку
zh_cn: 请输入链接
zh_tw: 請輸入連結

source: Add Widget
de_de: Widget hinzufügen
ja_jp: ウィジェットを追加
ko_kr: 위젯 추가
ru_ru: Добавить виджет
zh_cn: 添加小组件
zh_tw: 新增小組件

# please_select_widget_to_add
source: Please select a widget to add:
de_de: Bitte Widget zum Hinzufügen auswählen:
ja_jp: 追加するウィジェットを選択してください：
ko_kr: 추가할 위젯을 선택하십시오:
ru_ru: Выберите виджет:
zh_cn: 请选择要添加的组件：
zh_tw: 請選擇要新增的組件：

source: Please select a widget
de_de: Bitte ein Widget auswählen
ja_jp: ウィジェットを選択してください
ko_kr: 위젯을 선택하십시오
ru_ru: Выберите виджет
zh_cn: 请选择一个组件
zh_tw: 請選擇一個組件

source: Server Announcements
de_de: Serverankündigungen
ja_jp: サーバーからのお知らせ
ko_kr: 서버 공지
ru_ru: Объявления сервера
zh_cn: 服务器公告
zh_tw: 伺服器公告

source: Refresh
de_de: Aktualisieren
ja_jp: 更新
ko_kr: 새로 고침
ru_ru: Обновить
zh_cn: 刷新
zh_tw: 重新整理

source: Developer Maintenance Tools
de_de: Entwicklerwartungstools
ja_jp: 開発者メンテナンスツール
ko_kr: 개발자 유지 관리 도구
ru_ru: Инструменты разработчика
zh_cn: 开发者维护工具
zh_tw: 開發者維護工具

# drawing_template_repair_tool
source: Diagram Template Repair Tool
de_de: Zeichenvorlagenreparaturtool
ja_jp: 図解テンプレート修復ツール
ko_kr: 도면 템플릿 복구 도구
ru_ru: Инструмент восстановления шаблонов
zh_cn: 图解模板修复工具
zh_tw: 圖解範本修復工具

source: Start Check and Repair
de_de: Prüfung und Reparatur starten
ja_jp: チェックと修復を開始
ko_kr: 검사 및 복구 시작
ru_ru: Начать проверку и восстановление
zh_cn: 开始检查与修复
zh_tw: 開始檢查與修復

source: Close File
de_de: Datei schließen
ja_jp: ファイルを閉じる
ko_kr: 파일 닫기
ru_ru: Закрыть файл
zh_cn: 关闭文件
zh_tw: 關閉檔案

source: Open Import
de_de: Import öffnen
ja_jp: インポートを開く
ko_kr: 가져오기 열기
ru_ru: Открыть импорт
zh_cn: 打开导入
zh_tw: 開啟匯入

source: Add Language Column
de_de: Sprachspalte hinzufügen
ja_jp: 言語列を追加
ko_kr: 언어 열 추가
ru_ru: Добавить столбец языка
zh_cn: 添加语言列
zh_tw: 新增語言欄

source: Swap Language Columns
de_de: Sprachspalten tauschen
ja_jp: 言語列を入れ替え
ko_kr: 언어 열 교환
ru_ru: Поменять столбцы языка
zh_cn: 交换语言列
zh_tw: 交換語言欄

source: Delete Language Column
de_de: Sprachspalte löschen
ja_jp: 言語列を削除
ko_kr: 언어 열 삭제
ru_ru: Удалить столбец языка
zh_cn: 删除语言列
zh_tw: 刪除語言欄

# click_or_drag_template_json_here
source: Click or drag template file (JSON) here
de_de: Klicken oder JSON-Vorlagendatei hierher ziehen
ja_jp: テンプレートファイル(JSON)をクリックまたはドラッグしてください
ko_kr: 템플릿 파일(JSON)을 클릭하거나 이곳으로 드래그하십시오
ru_ru: Нажмите или перетащите файл шаблона (JSON) сюда
zh_cn: 点击或拖拽模板文件(JSON)到此处
zh_tw: 點擊或拖曳範本檔案(JSON)到此處

# support_json_format
source: Supports .json format
de_de: Unterstützt .json Format
ja_jp: .json 形式をサポート
ko_kr: json 형식 지원
ru_ru: Поддержка .json
zh_cn: 支持 .json 格式
zh_tw: 支援 .json 格式

source: Save Changes
de_de: Änderungen speichern
ja_jp: 変更を保存
ko_kr: 변경 사항 저장
ru_ru: Сохранить изменения
zh_cn: 保存更改
zh_tw: 儲存更改

source: Select Drawing Template File
de_de: Zeichenvorlagendatei auswählen
ja_jp: 描画テンプレートファイルを選択
ko_kr: 드로잉 템플릿 파일 선택
ru_ru: Выберите файл шаблона
zh_cn: 选择绘图模板文件
zh_tw: 選擇繪圖範本檔案

source: Edit Menu Bar Item
de_de: Menüleisteneintrag bearbeiten
ja_jp: メニューバー項目を編集
ko_kr: 메뉴 모음 항목 편집
ru_ru: Редактировать пункт меню
zh_cn: 编辑菜单栏项
zh_tw: 編輯選單欄項

source: Import Custom Diagram Template
de_de: Benutzerdefinierte Diagrammvorlage importieren
ja_jp: カスタム図解テンプレートをインポート
ko_kr: 사용자 정의 다이어그램 템플릿 가져오기
ru_ru: Импорт пользовательского шаблона
zh_cn: 导入自定义图解模板
zh_tw: 匯入自訂圖解範本

source: Open File Location
de_de: Dateispeicherort öffnen
ja_jp: ファイルの場所を開く
ko_kr: 파일 위치 열기
ru_ru: Открыть расположение файла
zh_cn: 打开文件位置
zh_tw: 開啟檔案位置

source: Export Diagram Template
de_de: Diagrammvorlage exportieren
ja_jp: 図解テンプレートをエクスポート
ko_kr: 다이어그램 템플릿 내보내기
ru_ru: Экспорт шаблона диаграммы
zh_cn: 导出图解模板
zh_tw: 匯出圖解範本

# downloading_ellipsis
source: Downloading...
de_de: Wird heruntergeladen...
ja_jp: ダウンロード中...
ko_kr: 다운로드 중...
ru_ru: Загрузка...
zh_cn: 正在下载...
zh_tw: 正在下載...

# initializing_language_service_ellipsis
source: Initializing language service...
de_de: Initialisiere Sprachdienst...
ja_jp: 言語サービスを初期化中...
ko_kr: 언어 서비스 초기화 중...
ru_ru: Инициализация языковой службы...
zh_cn: 正在初始化语言服务...
zh_tw: 正在初始化語言服務...

# loading_font_resources_ellipsis
source: Loading font resources...
de_de: Lade Schriftarten...
ja_jp: フォントリソースを読み込み中...
ko_kr: 글꼴 리소스 로드 중...
ru_ru: Загрузка шрифтов...
zh_cn: 正在加载字体资源...
zh_tw: 正在載入字型資源...

# reading_user_configuration_ellipsis
source: Reading user configuration...
de_de: Lese Benutzerkonfiguration...
ja_jp: ユーザー設定を読み込み中...
ko_kr: 사용자 구성 읽는 중...
ru_ru: Чтение конфигурации пользователя...
zh_cn: 正在读取用户配置...
zh_tw: 正在讀取使用者配置...

# loading_drawing_module_ellipsis
source: Loading drawing module...
de_de: Lade Zeichenmodul...
ja_jp: 描画モジュールを読み込み中...
ko_kr: 드로잉 모듈 로드 중...
ru_ru: Загрузка модуля рисования...
zh_cn: 正在加载绘图模块...
zh_tw: 正在載入繪圖模組...

# loading_main_interface_components_ellipsis
source: Loading main interface components...
de_de: Lade Hauptkomponenten...
ja_jp: メインインターフェイスコンポーネントを読み込み中...
ko_kr: 메인 인터페이스 구성 요소 로드 중...
ru_ru: Загрузка компонентов интерфейса...
zh_cn: 正在加载主界面组件...
zh_tw: 正在載入主介面組件...

# entering_soon_ellipsis
source: Entering soon...
de_de: Gleich fertig...
ja_jp: まもなく開始します...
ko_kr: 곧 입장합니다...
ru_ru: Скоро вход...
zh_cn: 即将进入...
zh_tw: 即將進入...

source: Completed
de_de: Abgeschlossen
ja_jp: 完了
ko_kr: 완료
ru_ru: Готово
zh_cn: 完成
zh_tw: 完成

# error_occurred_during_startup
source: An error occurred during startup:
de_de: Fehler beim Starten:
ja_jp: 起動中にエラーが発生しました:
ko_kr: 시작 중 오류 발생:
ru_ru: Ошибка при запуске:
zh_cn: 启动过程中发生错误:
zh_tw: 啟動過程中發生錯誤:

# language_apperarance
source: LANGUAGE & APPEARANCE
de_de: Sprache und Erscheinungsbild
ja_jp: 言語と外観
ko_kr: 언어 및 모양
ru_ru: Язык и вид
zh_cn: 语言与外观
zh_tw: 語言與外觀

source: Startup Background Image
de_de: Start-Hintergrundbild
ja_jp: 起動時の背景画像
ko_kr: 시작 배경 이미지
ru_ru: Фоновое изображение запуска
zh_cn: 启动背景图片
zh_tw: 啟動背景圖片

source: Add Image
de_de: Bild hinzufügen
ja_jp: 画像を追加
ko_kr: 이미지 추가
ru_ru: Добавить изображение
zh_cn: 添加图片
zh_tw: 新增圖片

source: EXTERNAL APPLICATIONS
de_de: Externe Anwendungen
ja_jp: 外部アプリケーション
ko_kr: 외부 응용 프로그램
ru_ru: Внешние приложения
zh_cn: 外部应用程序
zh_tw: 外部應用程式

source: Custom App
de_de: Benutzerdefinierte App
ja_jp: カスタムアプリ
ko_kr: 사용자 지정 앱
ru_ru: Пользовательское приложение
zh_cn: 自定义应用
zh_tw: 自訂應用

source: PLOT DEFAULTS
de_de: Plot-Standardeinstellungen
ja_jp: 描画のデフォルト設定
ko_kr: 플롯 기본 설정
ru_ru: Настройки графика по умолчанию
zh_cn: 绘图默认设置
zh_tw: 繪圖預設設定

source: Default Diagram Expand Level
de_de: Standard-Erweiterungsebene
ja_jp: デフォルトの図解展開レベル
ko_kr: 기본 다이어그램 확장 레벨
ru_ru: Уровень развертывания диаграммы по умолчанию
zh_cn: 默认图解展开层级
zh_tw: 預設圖解展開層級

source: Default Third-Party Editor
de_de: Standard-Drittanbieter-Editor
ja_jp: デフォルトのサードパーティエディタ
ko_kr: 기본 타사 편집기
ru_ru: Сторонний редактор по умолчанию
zh_cn: 默认第三方编辑程序
zh_tw: 預設第三方編輯程式

source: AUTOMATIC UPDATES
de_de: Automatische Updates
ja_jp: 自動更新
ko_kr: 자동 업데이트
ru_ru: Автообновление
zh_cn: 自动更新
zh_tw: 自動更新

source: Auto Check Diagram Template Updates
de_de: Automatisch nach Vorlagenupdates suchen
ja_jp: 図解テンプレートの更新を自動的に確認
ko_kr: 다이어그램 템플릿 업데이트 자동 확인
ru_ru: Автопроверка обновлений шаблонов
zh_cn: 自动检查图解模板更新
zh_tw: 自動檢查圖解範本更新

source: COMMUNITY
ja_jp: コミュニティ
ko_kr: 커뮤니티
ru_ru: Сообщество
zh_cn: 社区
zh_tw: 社群

# export_and_tools
source: Export / Tools
ja_jp: エクスポート/ツール
ko_kr: 내보내기/도구
ru_ru: Экспорт/Инструменты
zh_cn: 导出/工具
zh_tw: 匯出/工具

source: Format
ja_jp: 形式
ko_kr: 형식
ru_ru: Формат
zh_cn: 格式
zh_tw: 格式

# third_party_software
source: Third Party Apps
de_de: Drittanbietersoftware
ja_jp: サードパーティソフトウェア
ko_kr: 타사 소프트웨어
ru_ru: Стороннее ПО
zh_cn: 第三方软件
zh_tw: 第三方軟體

source: Select Software
de_de: Software auswählen
ja_jp: ソフトウェアを選択
ko_kr: 소프트웨어 선택
ru_ru: Выбрать ПО
zh_cn: 选择软件
zh_tw: 選擇軟體

source: Open with Third-Party Software
de_de: Mit Drittanbietersoftware öffnen
ja_jp: サードパーティソフトウェアで開く
ko_kr: 타사 소프트웨어로 열기
ru_ru: Открыть в стороннем ПО
zh_cn: 第三方软件打开
zh_tw: 第三方軟體開啟

# confirm_enter_edit_mode_base_map
source: Are you sure you want to enter edit mode? This will allow you to modify the base map.
de_de: Möchten Sie wirklich in den Bearbeitungsmodus wechseln? Dies erlaubt das Ändern der Grundkarte.
ja_jp: 編集モードに入ってもよろしいですか？これにより、ベースマップを変更できるようになります。
ko_kr: 편집 모드로 들어가시겠습니까? 이렇게 하면 베이스맵을 수정할 수 있습니다.
ru_ru: Вы уверены, что хотите войти в режим редактирования? Это позволит изменять подложку.
zh_cn: 确定要进入编辑模式吗？这将允许您修改底图。
zh_tw: 確定要進入編輯模式嗎？這將允許您修改底圖。

source: Information
de_de: Info
ja_jp: 情報
ko_kr: 정보
ru_ru: Информация
zh_cn: 提示
zh_tw: 提示

# click_to_pick_coordinates
source: Please click in the drawing area to pick coordinates
de_de: Bitte in den Zeichenbereich klicken, um Koordinaten zu wählen
ja_jp: 描画領域をクリックして座標をピックしてください
ko_kr: 좌표를 선택하려면 플롯 영역을 클릭하십시오
ru_ru: Кликните в области графика для получения координат
zh_cn: 请在绘图区域点击以拾取坐标
zh_tw: 請在繪圖區域點擊以拾取座標

source: Picking operation cancelled
de_de: Auswahlvorgang abgebrochen
ja_jp: ピック操作がキャンセルされました
ko_kr: 선택 작업 취소됨
ru_ru: Операция отменена
zh_cn: 拾取操作已取消
zh_tw: 拾取操作已取消

source: Diagram
de_de: Diagramm
ja_jp: 図解
ko_kr: 다이어그램
ru_ru: Диаграмма
zh_cn: 图解
zh_tw: 圖解

source: Official Website
de_de: Offizielle Website
ja_jp: 公式サイト
ko_kr: 공식 웹사이트
ru_ru: Официальный сайт
zh_cn: 官网
zh_tw: 官網

source: Minimize
de_de: Minimieren
ja_jp: 最小化
ko_kr: 최소화
ru_ru: Свернуть
zh_cn: 最小化
zh_tw: 最小化

source: Maximize
de_de: Maximieren
ja_jp: 最大化
ko_kr: 최대화
ru_ru: Развернуть
zh_cn: 最大化
zh_tw: 最大化

source: Close
de_de: Schließen
ja_jp: 閉じる
ko_kr: 닫기
ru_ru: Закрыть
zh_tw: 關閉

source: Diagram Title Properties
de_de: Diagrammtiteleigenschaften
ja_jp: 図解タイトルプロパティ
ko_kr: 다이어그램 제목 속성
ru_ru: Свойства заголовка диаграммы
zh_cn: 图解标题属性
zh_tw: 圖解標題屬性

source: Diagram Script Properties
de_de: Diagrammskripteigenschaften
ja_jp: 図解スクリプトプロパティ
ko_kr: 다이어그램 스크립트 속성
ru_ru: Свойства скрипта диаграммы
zh_cn: 图解脚本属性
zh_tw: 圖解腳本屬性

source: Diagram Legend Properties
de_de: Diagrammlegendeneigenschaften
ja_jp: 図解凡例プロパティ
ko_kr: 다이어그램 범례 속성
ru_ru: Свойства легенды диаграммы
zh_cn: 图解图例属性
zh_tw: 圖解圖例屬性

source: Diagram Grid Properties
de_de: Diagrammgittereigenschaften
ja_jp: 図解グリッドプロパティ
ko_kr: 다이어그램 그리드 속성
ru_ru: Свойства сетки диаграммы
zh_cn: 图解网格属性
zh_tw: 圖解網格屬性

source: Switch Diagram Language
de_de: Diagrammsprache wechseln
ja_jp: 図解言語を切り替え
ko_kr: 다이어그램 언어 전환
ru_ru: Переключить язык диаграммы
zh_cn: 切换图解语言
zh_tw: 切換圖解語言

source: Pop-up Diagram Window
de_de: Diagrammfenster ausklappen
ja_jp: 図解ウィンドウをポップアップ
ko_kr: 다이어그램 창 팝업
ru_ru: Всплывающее окно диаграммы
zh_cn: 弹出图解窗口
zh_tw: 彈出圖解視窗

source: Independent Diagram Window
de_de: Unabhängiges Diagrammfenster
ja_jp: 独立した図解ウィンドウ
ko_kr: 독립 다이어그램 창
ru_ru: Отдельное окно диаграммы
zh_cn: 独立图解窗口
zh_tw: 獨立圖解視窗

source: Edit Drawing Template Translations
de_de: Übersetzungen der Zeichenvorlage bearbeiten
ja_jp: 描画テンプレートの多言語翻訳を編集
ko_kr: 드로잉 템플릿 다국어 번역 편집
ru_ru: Редактировать переводы шаблона
zh_cn: 编辑绘图模板的多语言翻译
zh_tw: 編輯繪圖範本的多語言翻譯

# repair_missing_or_damaged_templates_and_lists
source: Repair missing or damaged drawing templates and lists
de_de: Fehlende oder beschädigte Vorlagen und Listen reparieren
ja_jp: 紛失または破損した描画テンプレートとリストを修復
ko_kr: 누락되거나 손상된 드로잉 템플릿 및 목록 복구
ru_ru: Восстановить утерянные или поврежденные шаблоны
zh_cn: 修复丢失或损坏的绘图模板及列表
zh_tw: 修復丟失或損壞的繪圖範本及列表

# view_latest_server_announcements
source: View the latest announcements from the server
de_de: Neueste Serverankündigungen anzeigen
ja_jp: サーバーからの最新のお知らせを表示
ko_kr: 서버의 최신 공지 사항 보기
ru_ru: Просмотр последних объявлений сервера
zh_cn: 查看服务器发布的最新公告信息
zh_tw: 檢視伺服器發布的最新公告資訊

# maintain_server_config_and_templates
source: Maintain server configurations and template files
de_de: Serverkonfiguration und Vorlagen warten
ja_jp: サーバー構成とテンプレートファイルを保守
ko_kr: 서버 구성 및 템플릿 파일 유지 관리
ru_ru: Обслуживание конфигурации и шаблонов
zh_cn: 维护服务器配置与模板文件
zh_tw: 維護伺服器配置與範本檔案
