Repository: MaxwellLei/GeoChemistry-Nexus
Catalog: src/Data/Language/Language.*.resx
Languages: de_de, ja_jp, ko_kr, ru_ru, zh_cn, zh_tw

# StartStatus
source: Starting...
de_de: Starten...
ja_jp: 起動中...
ko_kr: 시작 중...
ru_ru: Запуск...
zh_cn: 启动中...
zh_tw: 啟動中...

source: Show
de_de: Oberfläche anzeigen
ja_jp: 表示する
ko_kr: 인터페이스 표시
ru_ru: Показать интерфейс
zh_cn: 显示界面
zh_tw: 顯示介面

source: Exit
de_de: Programm beenden
ja_jp: 終了
ko_kr: 프로그램 종료
ru_ru: Выход
zh_cn: 退出程序
zh_tw: 退出程式

source: Home
de_de: Startseite
ja_jp: ホーム
ko_kr: 홈
ru_ru: Главная
zh_cn: 主页
zh_tw: 首頁

# Plot
source: Diagram Plot
de_de: Diagramm zeichnen
ja_jp: 図解描画
ko_kr: 다이어그램 플롯
ru_ru: Построение диаграмм
zh_cn: 图解绘图
zh_tw: 圖解繪圖

source: Geothermometer
ja_jp: 地質温度計
ko_kr: 지질 온도계
ru_ru: Геотермометр
zh_cn: 地质温度计
zh_tw: 地質溫度計

source: Setting
de_de: Einstellungen
ja_jp: 設定
ko_kr: 설정
ru_ru: Настройки
zh_cn: 设置
zh_tw: 設定

# File
source: _File(F)
de_de: _Datei(F)
ja_jp: ファイル(_F)
ko_kr: 파일(_F)
ru_ru: _Файл(F)
zh_cn: _文件(F)
zh_tw: _檔案(F)

source: Edit
de_de: Bearbeiten
ja_jp: 編集
ko_kr: 편집
ru_ru: Правка
zh_cn: 编辑
zh_tw: 編輯

source: Expand
de_de: Erweiterungen
ja_jp: 拡張
ko_kr: 확장
ru_ru: Расширить
zh_cn: 拓展
zh_tw: 拓展

source: Edit Mode
de_de: Bearbeitungsmodus
ja_jp: 編集モード
ko_kr: 편집 모드
ru_ru: Режим редактирования
zh_cn: 编辑模式
zh_tw: 編輯模式

source: New Basemap
de_de: Neue Grundkarte
ja_jp: 新規ベースマップ
ko_kr: 새 베이스맵
ru_ru: Новая подложка
zh_cn: 新建底图
zh_tw: 新增底圖

source: Save Basemap
de_de: Grundkarte speichern
ja_jp: ベースマップを保存
ko_kr: 베이스맵 저장
ru_ru: Сохранить подложку
zh_cn: 保存底图
zh_tw: 儲存底圖

source: Import Basemap
de_de: Grundkarte importieren
ja_jp: ベースマップをインポート
ko_kr: 베이스맵 가져오기
ru_ru: Импорт подложки
zh_cn: 导入底图
zh_tw: 匯入底圖

source: Export Basemap
de_de: Grundkarte exportieren
ja_jp: ベースマップをエクスポート
ko_kr: 베이스맵 내보내기
ru_ru: Экспорт подложки
zh_cn: 导出底图
zh_tw: 匯出底圖

source: Delete Basemap
de_de: Grundkarte löschen
ja_jp: ベースマップを削除
ko_kr: 베이스맵 삭제
ru_ru: Удалить подложку
zh_cn: 删除底图
zh_tw: 刪除底圖

# GetMoreBasemap
source: Get More Basemaps
de_de: Mehr Grundkarten abrufen
ja_jp: 他のベースマップを取得
ko_kr: 더 많은 베이스맵 받기
ru_ru: Больше подложек
zh_cn: 获取更多底图
zh_tw: 取得更多底圖

source: Import Data
de_de: Daten importieren
ja_jp: データをインポート
ko_kr: 데이터 가져오기
ru_ru: Импорт данных
zh_cn: 导入数据
zh_tw: 匯入資料

source: Reset Plot
de_de: Diagramm zurücksetzen
ja_jp: 描画をリセット
ko_kr: 플롯 초기화
ru_ru: Сброс графика
zh_cn: 重置绘图
zh_tw: 重設繪圖

# ResetVision
source: Reset View
de_de: Ansicht zurücksetzen
ja_jp: ビューをリセット
ko_kr: 뷰 재설정
ru_ru: Сброс вида
zh_cn: 视图复位
zh_tw: 重設檢視

# CancelSelected
source: Deselect
de_de: Auswahl aufheben
ja_jp: 選択解除
ko_kr: 선택 취소
ru_ru: Снять выделение
zh_cn: 取消选中
zh_tw: 取消選取

# LocationAxis
source: Locate
de_de: Positionsachse
ja_jp: 軸の位置合わせ
ko_kr: 위치 축
ru_ru: Ось координат
zh_cn: 定位轴
zh_tw: 定位軸

# ExportImage
source: Export
de_de: Bild exportieren
ja_jp: 画像をエクスポート
ko_kr: 이미지 내보내기
ru_ru: Экспорт изображения
zh_cn: 导出图片
zh_tw: 匯出圖片

# ExportImagePNG
source: Export as PNG
de_de: Als PNG exportieren
ja_jp: PNG 形式でエクスポート
ko_kr: PNG 형식으로 내보내기
ru_ru: Экспорт в PNG
zh_cn: 导出 PNG 格式
zh_tw: 匯出 PNG 格式

# ExportImageJPG
source: Export as JPG
de_de: Als JPG exportieren
ja_jp: JPG 形式でエクスポート
ko_kr: JPG 형식으로 내보내기
ru_ru: Экспорт в JPG
zh_cn: 导出 JPG 格式
zh_tw: 匯出 JPG 格式

# ExportImageBMP
source: Export as BMP
de_de: Als BMP exportieren
ja_jp: BMP 形式でエクスポート
ko_kr: BMP 형식으로 내보내기
ru_ru: Экспорт в BMP
zh_cn: 导出 BMP 格式
zh_tw: 匯出 BMP 格式

# ExportImageWebp
source: Export as Webp
de_de: Als Webp exportieren
ja_jp: WebP 形式でエクスポート
ko_kr: Webp 형식으로 내보내기
ru_ru: Экспорт в WebP
zh_cn: 导出 Webp 格式
zh_tw: 匯出 Webp 格式

# ExportImageSVG
source: Export as SVG
de_de: Als SVG exportieren
ja_jp: SVG 形式でエクスポート
ko_kr: SVG 형식으로 내보내기
ru_ru: Экспорт в SVG
zh_cn: 导出 SVG 格式
zh_tw: 匯出 SVG 格式

# LegendSetting
source: Legend
de_de: Legendeneinstellungen
ja_jp: 凡例設定
ko_kr: 범례 설정
ru_ru: Настройки легенды
zh_cn: 图例设置
zh_tw: 圖例設定

# PlotSetting
source: Plot Settings
de_de: Diagrammeinstellungen
ja_jp: 描画設定
ko_kr: 플롯 설정
ru_ru: Настройки графика
zh_cn: 绘图设置
zh_tw: 繪圖設定

source: Add Line
de_de: Linie hinzufügen
ja_jp: 線を追加
ko_kr: 선 추가
ru_ru: Добавить линию
zh_cn: 添加线条
zh_tw: 新增線條

source: Add Polygons
de_de: Polygon hinzufügen
ja_jp: ポリゴンを追加
ko_kr: 다각형 추가
ru_ru: Добавить полигон
zh_cn: 添加多边形
zh_tw: 新增多邊形

source: Add Text
de_de: Kommentar hinzufügen
ja_jp: 注釈を追加
ko_kr: 주석 추가
ru_ru: Добавить примечание
zh_cn: 添加注释
zh_tw: 新增註釋

# JsSetting
source: Script Settings
de_de: Skripteinstellungen
ja_jp: スクリプト設定
ko_kr: 스크립트 설정
ru_ru: Настройки скрипта
zh_cn: 脚本设置
zh_tw: 腳本設定

source: Save
de_de: Speichern
ja_jp: 保存
ko_kr: 저장
ru_ru: Сохранить
zh_cn: 保存
zh_tw: 儲存

source: Quit Edit
de_de: Bearbeitung beenden
ja_jp: 編集を終了
ko_kr: 편집 종료
ru_ru: Выйти из редактирования
zh_cn: 退出编辑
zh_tw: 退出編輯

source: Igneous Rock
de_de: Magmatisches Gestein
ja_jp: 火成岩
ko_kr: 화성암
ru_ru: Магматические породы
zh_cn: 岩浆岩
zh_tw: 火成岩

source: Tectonic Setting
de_de: Tektonisches Umfeld
ja_jp: 構造環境
ko_kr: 구조적 환경
ru_ru: Тектоническая обстановка
zh_cn: 构造环境
zh_tw: 構造環境

source: Basalt
ja_jp: 玄武岩
ko_kr: 현무암
ru_ru: Базальт
zh_cn: 玄武岩
zh_tw: 玄武岩

source: Rock Classification
de_de: Gesteinsklassifikation
ja_jp: 岩石分類
ko_kr: 암석 분류
ru_ru: Классификация пород
zh_cn: 岩石分类
zh_tw: 岩石分類

# GTMP
source: Temperature Plot
de_de: Temperaturdiagramm
ja_jp: 温度プロット
ko_kr: 온도 플롯
ru_ru: Температурный график
zh_cn: 温度绘图
zh_tw: 溫度繪圖

source: Guide
de_de: Anleitung
ja_jp: ガイド
ko_kr: 가이드
ru_ru: Руководство
zh_cn: 指南
zh_tw: 指南

# BorderLine
source: Border
de_de: Grenze
ja_jp: 境界線
ko_kr: 경계
ru_ru: Граница
zh_cn: 边界
zh_tw: 邊界

# PlotText
source: Annotation
de_de: Kommentar
ja_jp: 注釈
ko_kr: 주석
ru_ru: Примечание
zh_cn: 注释
zh_tw: 註釋

# PlotAxies
source: Axes
de_de: Koordinatenachse
ja_jp: 座標軸
ko_kr: 좌표축
ru_ru: Оси координат
zh_cn: 坐标轴
zh_tw: 座標軸

# PlotLeftAxies
source: Left Axis
de_de: Linke Achse
ja_jp: 左側座標軸
ko_kr: 왼쪽 좌표축
ru_ru: Левая ось
zh_cn: 左侧坐标轴
zh_tw: 左側座標軸

# PlotBottomAxies
source: Bottom Axis
de_de: Untere Achse
ja_jp: 下部座標軸
ko_kr: 하단 좌표축
ru_ru: Нижняя ось
zh_cn: 底部坐标轴
zh_tw: 底部座標軸

# PlotData
source: Data
de_de: Daten
ja_jp: データ
ko_kr: 데이터
ru_ru: Данные
zh_cn: 数据
zh_tw: 資料

source: Major Axes
de_de: Hauptachse
ja_jp: 主目盛軸
ko_kr: 주 눈금 축
ru_ru: Основные деления
zh_cn: 主刻度轴
zh_tw: 主刻度軸

source: Minor Axes
de_de: Nebenachse
ja_jp: 副目盛軸
ko_kr: 보조 눈금 축
ru_ru: Вспомогательные деления
zh_cn: 次刻度轴
zh_tw: 次刻度軸

source: Legend
de_de: Legende
ja_jp: 凡例
ko_kr: 범례
ru_ru: Легенда
zh_cn: 图例
zh_tw: 圖例

source: Background
de_de: Hintergrund
ja_jp: 背景
ko_kr: 배경
ru_ru: Фон
zh_cn: 背景
zh_tw: 背景

source: Calculate
de_de: Berechnen
ja_jp: 計算
ko_kr: 계산
ru_ru: Вычислить
zh_cn: 计算
zh_tw: 計算

source: Delete
de_de: Löschen
ja_jp: 削除
ko_kr: 삭제
ru_ru: Удалить
zh_cn: 删除
zh_tw: 刪除

source: Confirm
de_de: Bestätigen
ja_jp: 確認
ko_kr: 확인
ru_ru: Подтвердить
zh_cn: 确认
zh_tw: 確認

source: Cancel
de_de: Abbrechen
ja_jp: キャンセル
ko_kr: 취소
ru_ru: Отмена
zh_cn: 取消
zh_tw: 取消

# IsShow
source: Visible
de_de: Anzeigen
ja_jp: 表示する
ko_kr: IsShow
ru_ru: Показывать
zh_cn: IsShow
zh_tw: IsShow

source: Font Family
de_de: Schriftart
ja_jp: フォント
ko_kr: 글꼴
ru_ru: Шрифт
zh_cn: 字体
zh_tw: 字型

source: Font Style
de_de: Schriftstil
ja_jp: フォントスタイル
ko_kr: 글꼴 스타일
ru_ru: Стиль шрифта
zh_cn: 字体样式
zh_tw: 字型樣式

# FontNormal
source: Normal
de_de: Standard
ja_jp: 標準
ko_kr: 기본값
ru_ru: Обычный
zh_cn: 默认
zh_tw: 預設

# FontBold
source: Bold
de_de: Fett
ja_jp: 太字
ko_kr: 굵게
ru_ru: Жирный
zh_cn: 加粗
zh_tw: 粗體

# FontItalic
source: Italic
de_de: Kursiv
ja_jp: 斜体
ko_kr: 기울임꼴
ru_ru: Курсив
zh_cn: 斜体
zh_tw: 斜體

source: Font Size
de_de: Schriftgröße
ja_jp: フォントサイズ
ko_kr: 글꼴 크기
ru_ru: Размер шрифта
zh_cn: 字体大小
zh_tw: 字型大小

source: Font Color
de_de: Schriftfarbe
ja_jp: フォントの色
ko_kr: 글꼴 색상
ru_ru: Цвет шрифта
zh_cn: 字体颜色
zh_tw: 字型顏色

# TextContent
source: Content
de_de: Inhalt
ja_jp: 内容
ko_kr: 내용
ru_ru: Содержание
zh_cn: 内容
zh_tw: 內容

source: Line Style
de_de: Linienstil
ja_jp: 線のスタイル
ko_kr: 선 스타일
ru_ru: Стиль линии
zh_cn: 线条样式
zh_tw: 線條樣式

# LineSolid
source: Solid
de_de: Durchgezogen
ja_jp: 実線
ko_kr: 실선
ru_ru: Сплошная
zh_cn: 实线
zh_tw: 實線

# LineDash
source: Dashed
de_de: Gestrichelt
ja_jp: 破線
ko_kr: 파선
ru_ru: Штриховая
zh_cn: 虚线
zh_tw: 虛線

# LineDashDot
source: Dash-Dot
de_de: Strichpunkt
ja_jp: 一点鎖線
ko_kr: 쇄선
ru_ru: Штрихпунктирная
zh_cn: 点线
zh_tw: 點線

# LineDenselyDashed
source: Densely Dashed
de_de: Dicht gestrichelt
ja_jp: 密集破線
ko_kr: 촘촘한 파선
ru_ru: Частая штриховая
zh_cn: 密集虚线
zh_tw: 密集虛線

# LineWidth
source: Width
de_de: Breite
ja_jp: 幅
ko_kr: 너비
ru_ru: Ширина
zh_cn: 宽度
zh_tw: 寬度

# LineColor
source: Color
de_de: Farbe
ja_jp: 色
ko_kr: 색상
ru_ru: Цвет
zh_cn: 颜色
zh_tw: 顏色

source: Point Style
de_de: Punktstil
ja_jp: 点のスタイル
ko_kr: 점 스타일
ru_ru: Стиль точки
zh_cn: 点样式
zh_tw: 點樣式

# PointCircle
source: Circle
de_de: Kreis
ja_jp: 円形
ko_kr: 원형
ru_ru: Круг
zh_cn: 圆形
zh_tw: 圓形

# PointHollowCircle
source: Hollow Circle
de_de: Hohler Kreis
ja_jp: 中空円
ko_kr: 빈 원형
ru_ru: Пустой круг
zh_cn: 空心圆形
zh_tw: 空心圓形

# PointSquare
source: Square
de_de: Quadrat
ja_jp: 正方形
ko_kr: 사각형
ru_ru: Квадрат
zh_cn: 方形
zh_tw: 方形

# PointFilledTriangleUp
source: Filled Triangle Up
de_de: Dreieck oben
ja_jp: 上向き三角形
ko_kr: 위쪽 삼각형
ru_ru: Треугольник вверх
zh_cn: 上三角形
zh_tw: 上三角形

# PointFilledTriangleDown
source: Filled Triangle Down
de_de: Dreieck unten
ja_jp: 下向き三角形
ko_kr: 아래쪽 삼각형
ru_ru: Треугольник вниз
zh_cn: 下三角形
zh_tw: 下三角形

# PointDiamond
source: Diamond
de_de: Raute
ja_jp: 菱形
ko_kr: 마름모
ru_ru: Ромб
zh_cn: 菱形
zh_tw: 菱形

# PointEks
source: X
de_de: Kreuz (X)
ja_jp: バツ印 (X)
ko_kr: X표
ru_ru: Крест (X)
zh_cn: 叉号
zh_tw: 叉號

# PointCross
source: Cross
de_de: Kreuz (+)
ja_jp: 十字
ko_kr: 십자형
ru_ru: Плюс (+)
zh_cn: 十字形
zh_tw: 十字形

# PointStar
source: Star
de_de: Stern
ja_jp: 星形
ko_kr: 별 모양
ru_ru: Звезда
zh_cn: 星形
zh_tw: 星形

source: Size
de_de: Größe
ja_jp: サイズ
ko_kr: 크기
ru_ru: Размер
zh_cn: 大小
zh_tw: 大小

# IsShowAxes
source: Show Axes
de_de: Achsen anzeigen
ja_jp: 軸を表示
ko_kr: 축 표시
ru_ru: Показать оси
zh_cn: 显示轴
zh_tw: 顯示軸

# IsShowAxesTick
source: Hide Major Ticks
de_de: Hauptstriche ausblenden
ja_jp: 主目盛を隠す
ko_kr: 주 눈금 숨기기
ru_ru: Скрыть основные деления
zh_cn: 隐藏主刻度
zh_tw: 隱藏主刻度

# AxesStyle
source: Axis Style
de_de: Achsenstil
ja_jp: 軸のスタイル
ko_kr: 눈금 축 스타일
ru_ru: Стиль осей
zh_cn: 刻度轴样式
zh_tw: 刻度軸樣式

# AxesStyleNormal
source: Normal
ja_jp: 通常
ko_kr: 일반
ru_ru: Обычный
zh_cn: 常规
zh_tw: 常規

# AxesTickFont
source: Tick Font
de_de: Achsenschriftart
ja_jp: 目盛のフォント
ko_kr: 눈금 축 글꼴
ru_ru: Шрифт делений
zh_cn: 刻度轴字体
zh_tw: 刻度軸字型

# AxesTickFontSize
source: Tick Font Size
de_de: Achsenschriftgröße
ja_jp: 目盛のサイズ
ko_kr: 눈금 글꼴 크기
ru_ru: Размер шрифта делений
zh_cn: 刻度字体大小
zh_tw: 刻度字型大小

# AxesTickSpacing
source: Tick Spacing
de_de: Achsenabstand
ja_jp: 目盛の間隔
ko_kr: 눈금 간격
ru_ru: Интервал делений
zh_cn: 刻度间距
zh_tw: 刻度間距

# AxesTickUpLimit
source: Upper Limit
de_de: Obergrenze
ja_jp: 目盛の上限
ko_kr: 눈금 상한
ru_ru: Верхний предел
zh_cn: 刻度上限
zh_tw: 刻度上限

# AxesTickDownLimit
source: Lower Limit
de_de: Untergrenze
ja_jp: 目盛の下限
ko_kr: 눈금 하한
ru_ru: Нижний предел
zh_cn: 刻度下限
zh_tw: 刻度下限

# AxesTickColor
source: Tick Color
de_de: Achsenfarbe
ja_jp: 目盛の色
ko_kr: 눈금 색상
ru_ru: Цвет делений
zh_cn: 刻度颜色
zh_tw: 刻度顏色

# IsShowMinorAxes
source: Hide Minor Ticks
de_de: Nebenstriche ausblenden
ja_jp: 副目盛を隠す
ko_kr: 보조 눈금 숨기기
ru_ru: Скрыть вспомогательные деления
zh_cn: 隐藏次刻度
zh_tw: 隱藏次刻度

# IsShowLegend
source: Show Legend
de_de: Legende anzeigen
ja_jp: 凡例を表示
ko_kr: 범례 표시 여부
ru_ru: Показать легенду
zh_cn: 是否显示图例
zh_tw: 是否顯示圖例

source: Legend Position
de_de: Legendenposition
ja_jp: 凡例の位置
ko_kr: 범례 위치
ru_ru: Позиция легенды
zh_cn: 图例位置
zh_tw: 圖例位置

# LegendPositionRU
source: Top Right
de_de: Rechts oben
ja_jp: 右上
ko_kr: 우측 상단
ru_ru: Справа сверху
zh_cn: 右上角
zh_tw: 右上角

# LegendPositionRD
source: Bottom Right
de_de: Rechts unten
ja_jp: 右下
ko_kr: 우측 하단
ru_ru: Справа снизу
zh_cn: 右下角
zh_tw: 右下角

# LegendPositionLU
source: Top Left
de_de: Links oben
ja_jp: 左上
ko_kr: 좌측 상단
ru_ru: Слева сверху
zh_cn: 左上角
zh_tw: 左上角

# LegendPositionLD
source: Bottom Left
de_de: Links unten
ja_jp: 左下
ko_kr: 좌측 하단
ru_ru: Слева снизу
zh_cn: 左下角
zh_tw: 左下角

source: Legend Direction
de_de: Legendenausrichtung
ja_jp: 凡例の方向
ko_kr: 범례 방향
ru_ru: Ориентация легенды
zh_cn: 图例方向
zh_tw: 圖例方向

# LegendVertical
source: Vertical
de_de: Vertikal
ja_jp: 縦方向
ko_kr: 세로
ru_ru: Вертикальная
zh_cn: 纵向
zh_tw: 縱向

# LegendHorizontal
source: Horizontal
ja_jp: 横方向
ko_kr: 가로
ru_ru: Горизонтальная
zh_cn: 横向
zh_tw: 橫向

source: Plot Title
de_de: Diagrammtitel
ja_jp: 図のタイトル
ko_kr: 플롯 제목
ru_ru: Заголовок графика
zh_cn: 绘图标题
zh_tw: 繪圖標題

# PlotTitleFont
source: Title Font
de_de: Titelschriftart
ja_jp: タイトルのフォント
ko_kr: 제목 글꼴
ru_ru: Шрифт заголовка
zh_cn: 标题字体
zh_tw: 標題字型

# PlotTitleFontSize
source: Title Font Size
de_de: Titelschriftgröße
ja_jp: タイトルのサイズ
ko_kr: 제목 글꼴 크기
ru_ru: Размер шрифта заголовка
zh_cn: 标题字体大小
zh_tw: 標題字型大小

# PlotTitleColor
source: Title Color
de_de: Titelfarbe
ja_jp: タイトルの色
ko_kr: 제목 색상
ru_ru: Цвет заголовка
zh_cn: 标题颜色
zh_tw: 標題顏色

# PlotAxesTitle1
source: Axis Title 1
de_de: Achsentitel 1
ja_jp: 軸タイトル1
ko_kr: 좌표축 제목 1
ru_ru: Заголовок оси 1
zh_cn: 坐标轴标题1
zh_tw: 座標軸標題1

# PlotAxesTitle2
source: Axis Title 2
de_de: Achsentitel 2
ja_jp: 軸タイトル2
ko_kr: 좌표축 제목 2
ru_ru: Заголовок оси 2
zh_cn: 坐标轴标题2
zh_tw: 座標軸標題2

# PlotAxesTitleFont
source: Axis Title Font
de_de: Achsentitelschriftart
ja_jp: 軸タイトルのフォント
ko_kr: 축 제목 글꼴
ru_ru: Шрифт заголовка оси
zh_cn: 轴标题字体
zh_tw: 軸標題字型

# PlotAxesTitleFontSize
source: Axis Title Font Size
de_de: Achsentitelschriftgröße
ja_jp: 軸タイトルのサイズ
ko_kr: 축 제목 글꼴 크기
ru_ru: Размер шрифта заголовка оси
zh_cn: 轴标题字体大小
zh_tw: 軸標題字型大小

# PlotAxesTitleColor
source: Axis Title Color
de_de: Achsentitelfarbe
ja_jp: 軸タイトルの色
ko_kr: 축 제목 색상
ru_ru: Цвет заголовка оси
zh_cn: 轴标题颜色
zh_tw: 軸標題顏色

# PlotShowGrid
source: Show Grid
de_de: Gitter anzeigen
ja_jp: グリッドを表示
ko_kr: 그리드 표시
ru_ru: Показать сетку
zh_cn: 显示网格
zh_tw: 顯示網格

# PlotMajorGridColor
source: Major Grid Color
de_de: Hauptgitterfarbe
ja_jp: 主グリッドの色
ko_kr: 주 그리드 색상
ru_ru: Цвет основной сетки
zh_cn: 主网格颜色
zh_tw: 主網格顏色

# PlotMajorGridWidth
source: Major Grid Width
de_de: Hauptgitterbreite
ja_jp: 主グリッドの幅
ko_kr: 주 그리드 두께
ru_ru: Ширина основной сетки
zh_cn: 主网格宽度
zh_tw: 主網格寬度

# PlotShowMinorGrid
source: Show Minor Grid
de_de: Nebengitter anzeigen
ja_jp: 副グリッドを表示
ko_kr: 보조 그리드 표시
ru_ru: Показать вспомогательную сетку
zh_cn: 显示次网格
zh_tw: 顯示次網格

# PlotMinorGridColor
source: Minor Grid Color
de_de: Nebengitterfarbe
ja_jp: 副グリッドの色
ko_kr: 보조 그리드 색상
ru_ru: Цвет вспомогательной сетки
zh_cn: 次网格颜色
zh_tw: 次網格顏色

# PlotMinorGridWidth
source: Minor Grid Width
de_de: Nebengitterbreite
ja_jp: 副グリッドの幅
ko_kr: 보조 그리드 두께
ru_ru: Ширина вспомогательной сетки
zh_cn: 次网格宽度
zh_tw: 次網格寬度

# PlotSwitchFilledColor
source: Invert Fill Color
de_de: Füllfarbe umkehren
ja_jp: 塗りつぶし色を反転
ko_kr: 채우기 색상 반전
ru_ru: Инвертировать цвет заливки
zh_cn: 反转填充颜色
zh_tw: 反轉填充顏色

# PlotFilledColor1
source: Fill Color 1
de_de: Füllbereichsfarbe 1
ja_jp: 領域の塗りつぶし色1
ko_kr: 채우기 영역 색상 1
ru_ru: Цвет заливки 1
zh_cn: 填充区域颜色1
zh_tw: 填充區域顏色1

# PlotFilledColor2
source: Fill Color 2
de_de: Füllbereichsfarbe 2
ja_jp: 領域の塗りつぶし色2
ko_kr: 채우기 영역 색상 2
ru_ru: Цвет заливки 2
zh_cn: 填充区域颜色2
zh_tw: 填充區域顏色2

# Parameters
source: Required Parameters
de_de: Erforderliche Parameter
ja_jp: 必須パラメータ
ko_kr: 필수 매개변수
ru_ru: Требуемые параметры
zh_cn: 所需参数
zh_tw: 所需參數

# Js
source: Js Script
de_de: Js Skript
ja_jp: JSスクリプト
ko_kr: Js 스크립트
ru_ru: JS скрипт
zh_cn: Js 脚本
zh_tw: Js 腳本

# CheckJs
source: Check Script
de_de: Skript prüfen
ja_jp: スクリプトを確認
ko_kr: 스크립트 확인
ru_ru: Проверить скрипт
zh_cn: 检查脚本
zh_tw: 檢查腳本

# Undelete_Message
source: Delete Canceled
de_de: Löschen rückgängig gemacht
ja_jp: 削除を取り消しました
ko_kr: 삭제 취소됨
ru_ru: Удаление отменено
zh_cn: 已取消删除
zh_tw: 已取消刪除

# DeleteingBasemapConfirm1_Message
source: Deleting Basemap
ja_jp: ベースマップを削除中
zh_tw: 正在刪除底圖

# DeleteingBasemapConfirm2_Message
source: Are you sure you want to delete?
de_de: Wirklich löschen?
ja_jp: 削除してもよろしいですか？
ko_kr: 삭제하시겠습니까?
ru_ru: Вы уверены, что хотите удалить?
zh_cn: 是否确认删除？
zh_tw: 是否確認刪除？

# SaveSuccess
source: Save Successful
de_de: Erfolgreich gespeichert
ja_jp: 保存に成功しました
ko_kr: 저장 성공
ru_ru: Успешно сохранено
zh_cn: 保存成功
zh_tw: 儲存成功

# ParameterNotFilledIn
source: Mapping parameters not filled in
de_de: Plot-Parameter nicht ausgefüllt
ja_jp: プロットパラメータが未入力です
ko_kr: 플롯 매개변수가 입력되지 않았습니다
ru_ru: Параметры графика не заполнены
zh_cn: 投图参数未填写
zh_tw: 投圖參數未填寫

# ScNotFilledIn
source: Mapping script not filled in
de_de: Plot-Skript nicht ausgefüllt
ja_jp: プロットスクリプトが未入力です
ko_kr: 플롯 스크립트가 입력되지 않았습니다
ru_ru: Скрипт графика не заполнен
zh_cn: 投图脚本未填写
zh_tw: 投圖腳本未填寫

# BasemapVersionToLow1
source: The imported basemap version is too low, please use a version higher than
ja_jp: インポートされたベースマップのバージョンが低すぎます。バージョン
zh_tw: 匯入的底圖版本過低，請使用版本大於

# BasemapVersionToLow2
source: version
ja_jp: 以上のベースマップを使用してください
zh_tw: 的底圖

# CancelImport
source: Import Canceled
de_de: Import abgebrochen
ja_jp: インポートを取り消しました
ko_kr: 가져오기 취소됨
ru_ru: Импорт отменен
zh_cn: 已取消导入
zh_tw: 已取消匯入

# BasemapExisted
source: Basemap file already exists, do you want to overwrite?
de_de: Grundkartendatei existiert bereits. Überschreiben?
ja_jp: ベースマップファイルは既に存在します。上書きしますか？
ko_kr: 베이스맵 파일이 이미 존재합니다. 덮어쓰시겠습니까?
ru_ru: Файл подложки уже существует, перезаписать?
zh_cn: 底图文件已经存在，是否覆盖？
zh_tw: 底圖檔案已經存在，是否覆蓋？

# NewBasemapSuccess
source: New Basemap Created Successfully
de_de: Neue Grundkarte erfolgreich erstellt
ja_jp: 新規ベースマップの作成に成功しました
ko_kr: 새 베이스맵 만들기 성공
ru_ru: Подложка успешно создана
zh_cn: 新建底图成功
zh_tw: 新增底圖成功

source: Category format error
de_de: Kategorieformatfehler
ja_jp: カテゴリの形式エラー
ko_kr: 범주 형식 오류
ru_ru: Ошибка формата категории
zh_cn: 类别格式错误
zh_tw: 類別格式錯誤

# ParameterNull
source: Parameter is null
de_de: Parameter ist leer
ja_jp: パラメータが空です
ko_kr: 매개변수가 비어 있음
ru_ru: Параметр пуст
zh_cn: 参数为空
zh_tw: 參數為空

# JsNull
source: Script is empty
de_de: Skript ist leer
ja_jp: スクリプトが空です
ko_kr: 스크립트가 비어 있음
ru_ru: Скрипт пуст
zh_cn: 脚本为空
zh_tw: 腳本為空

source: Basemap Categories
de_de: Grundkartenkategorie
ja_jp: ベースマップのカテゴリ
ko_kr: 베이스맵 범주
ru_ru: Категории подложки
zh_cn: 底图类别
zh_tw: 底圖類別

source: Basemap Language
de_de: Grundkartensprache
ja_jp: ベースマップの言語
ko_kr: 베이스맵 언어
ru_ru: Язык подложки
zh_cn: 底图语言
zh_tw: 底圖語言

source: Zircon
de_de: Zirkon
ja_jp: ジルコン
ko_kr: 지르콘
ru_ru: Циркон
zh_cn: 锆石
zh_tw: 鋯石

source: Sphalerite
de_de: Sphalerit
ja_jp: 閃亜鉛鉱
ko_kr: 섬아연석
ru_ru: Сфалерит
zh_cn: 闪锌矿
zh_tw: 閃鋅礦

source: Quartz
de_de: Quarz
ja_jp: 石英
ko_kr: 석영
ru_ru: Кварц
zh_cn: 石英
zh_tw: 石英

source: Arsenopyrite
de_de: Arsenopyrit
ja_jp: 硫砒鉄鉱
ko_kr: 유비철석
ru_ru: Арсенопирит
zh_cn: 毒砂
zh_tw: 毒砂

source: Chlorite
de_de: Chlorit
ja_jp: 緑泥石
ko_kr: 녹니석
ru_ru: Хлорит
zh_cn: 绿泥石
zh_tw: 綠泥石

source: Biotite
de_de: Biotit
ja_jp: 黒雲母
ko_kr: 흑운모
ru_ru: Биотит
zh_cn: 黑云母
zh_tw: 黑雲母

source: Amphibole
de_de: Amphibol
ja_jp: 角閃石
ko_kr: 각섬석
ru_ru: Амфибол
zh_cn: 角闪石
zh_tw: 角閃石

source: Reset
de_de: Zurücksetzen
ja_jp: リセット
ko_kr: 초기화
ru_ru: Сброс
zh_cn: 重置
zh_tw: 重置

# ExportResult
source: Export Results
de_de: Ergebnis exportieren
ja_jp: 結果をエクスポート
ko_kr: 결과 내보내기
ru_ru: Экспорт результата
zh_cn: 导出结果
zh_tw: 匯出結果

# TGMInfo
source: Click or drag files here
de_de: Hier klicken oder Datei hierher ziehen
ja_jp: クリックするか、ファイルをここにドラッグしてください
ko_kr: 파일을 클릭하거나 이곳으로 드래그하세요
ru_ru: Нажмите или перетащите файл сюда
zh_cn: 点击 或者 拖拽文件到此处
zh_tw: 點擊 或者 拖曳檔案到此處

# CalTarget
source: Calculation Target
de_de: Berechnungsziel
ja_jp: 計算対象
ko_kr: 계산 목표
ru_ru: Цель расчета
zh_cn: 计算目标
zh_tw: 計算目標

# CalTarget1
source: Zr Saturation Temperature (Watson and Harrison, 1983)
de_de: Zr-Sättigungstemperatur (Watson und Harrison, 1983)
ja_jp: Zr 飽和温度 (Watson and Harrison, 1983)
ko_kr: Zr 포화 온도 (Watson and Harrison, 1983)
ru_ru: Температура насыщения Zr (Watson and Harrison, 1983)
zh_cn: Zr 饱和温度 (Watson and Harrison, 1983)
zh_tw: Zr 飽和溫度 (Watson and Harrison, 1983)

# CalTarget2
source: Zr Major Element Temperature (Watson and Harrison, 1983)
de_de: Zr-Haupttemperatur (Watson und Harrison, 1983)
ja_jp: Zr 主成分温度 (Watson and Harrison, 1983)
ko_kr: Zr 주성분 온도 (Watson and Harrison, 1983)
ru_ru: Основная температура Zr (Watson and Harrison, 1983)
zh_cn: Zr 主量温度 (Watson and Harrison, 1983)
zh_tw: Zr 主量溫度 (Watson and Harrison, 1983)

# Pressure
source: Pressure (MPa)
de_de: Druck(Mpa)
ja_jp: 圧力(Mpa)
ko_kr: 압력(Mpa)
ru_ru: Давление (МПа)
zh_cn: 压力(Mpa)
zh_tw: 壓力(Mpa)

# AmphiboleGTM
source: Si Geothermometer (Ridolfi et al., 2010)
de_de: Si-Thermometer (Ridolfi et al., 2010)
ja_jp: Si 温度計 (Ridolfi et al., 2010)
ko_kr: Si 온도계 (Ridolfi et al., 2010)
ru_ru: Si Термометр (Ridolfi et al., 2010)
zh_cn: Si 温度计 (Ridolfi et al., 2010)
zh_tw: Si 溫度計 (Ridolfi et al., 2010)

# BiotiteGTM
source: Ti Geothermometer (Henry et al., 2005)
de_de: Ti-Thermometer (Henry et al., 2005)
ja_jp: Ti 温度計 (Henry et al., 2005)
ko_kr: Ti 온도계 (Henry et al., 2005)
ru_ru: Ti Термометр (Henry et al., 2005)
zh_cn: Ti 温度计 (Henry et al., 2005)
zh_tw: Ti 溫度計 (Henry et al., 2005)

# ChloriteGTM
source: Al4 Geothermometer (Jowett, 1991)
de_de: Al4-Thermometer (Jowett, 1991)
ja_jp: Al4 温度計 (Jowett, 1991)
ko_kr: Al4 온도계 (Jowett, 1991)
ru_ru: Al4 Термометр (Jowett, 1991)
zh_cn: Al4 温度计 (Jowett, 1991)
zh_tw: Al4 溫度計 (Jowett, 1991)

# ArsenopyriteGTM
source: Arsenopyrite Geothermometer (Kretschmar and Scott, 1976)
de_de: Arsenopyrit-Thermometer (Kretschmar und Scott, 1976)
ja_jp: 硫砒鉄鉱温度計 (Kretschmar and Scott, 1976)
ko_kr: 유비철석 온도계 (Kretschmar and Scott, 1976)
ru_ru: Арсенопиритовый термометр (Kretschmar and Scott, 1976)
zh_cn: 毒砂温度计 (Kretschmar and Scott, 1976)
zh_tw: 毒砂溫度計 (Kretschmar and Scott, 1976)

# QuartzGTM
source: TitaniQ Geothermometer (Wark and Watson, 2006)
de_de: TitaniQ-Thermometer (Wark und Watson, 2006)
ja_jp: TitaniQ 温度計 (Wark and Watson, 2006)
ko_kr: TitaniQ 온도계 (Wark and Watson, 2006)
ru_ru: Термометр TitaniQ (Wark and Watson, 2006)
zh_cn: TitaniQ 温度计 (Wark and Watson, 2006)
zh_tw: TitaniQ 溫度計 (Wark and Watson, 2006)

# SphaleriteGTM
source: FeS Geothermometer (Scott and Barnes, 1971)
de_de: FeS-Thermometer (Scott und Barnes, 1971)
ja_jp: FeS 温度計 (Scott and Barnes, 1971)
ko_kr: FeS 온도계 (Scott and Barnes, 1971)
ru_ru: FeS Термометр (Scott and Barnes, 1971)
zh_cn: FeS 温度计 (Scott and Barnes, 1971)
zh_tw: FeS 溫度計 (Scott and Barnes, 1971)

# SphaleriteGGIMFisGTM
source: GGIMFis Geothermometer (Frenzel et al., 2016)
de_de: GGIMFis-Thermometer (Frenzel et al., 2016)
ja_jp: GGIMFis 温度計 (Frenzel et al., 2016)
ko_kr: GGIMFis 온도계 (Frenzel et al., 2016)
ru_ru: GGIMFis Термометр (Frenzel et al., 2016)
zh_cn: GGIMFis 温度计 (Frenzel et al., 2016)
zh_tw: GGIMFis 溫度計 (Frenzel et al., 2016)

# ZirconTiGTM
source: Ti Geothermometer (Loucks et al., 2020)
de_de: Ti-Thermometer (Loucks et al., 2020)
ja_jp: Ti 温度計 (Loucks et al., 2020)
ko_kr: Ti 온도계 (Loucks et al., 2020)
ru_ru: Ti Термометр (Loucks et al., 2020)
zh_cn: Ti 温度计 (Loucks et al., 2020)
zh_tw: Ti 溫度計 (Loucks et al., 2020)

# ZirconZrGTM
source: Zr Geothermometer (Watson and Harrison, 1983)
de_de: Zr-Thermometer (Watson und Harrison, 1983)
ja_jp: Zr 温度計 (Watson and Harrison, 1983)
ko_kr: Zr 온도계 (Watson and Harrison, 1983)
ru_ru: Zr Термометр (Watson and Harrison, 1983)
zh_cn: Zr 温度计 (Watson and Harrison, 1983)
zh_tw: Zr 溫度計 (Watson and Harrison, 1983)

# Step1
source: Import / Enter Data
de_de: Daten importieren / eingeben
ja_jp: データのインポート / 入力
ko_kr: 데이터 가져오기 / 입력
ru_ru: Импорт / Ввод данных
zh_cn: 导入 / 填入数据
zh_tw: 匯入 / 填入資料

# Step2
source: Check Parameters
de_de: Parameter prüfen
ja_jp: パラメータの確認
ko_kr: 매개변수 확인
ru_ru: Проверка параметров
zh_cn: 检查参数
zh_tw: 檢查參數

# Step3
source: Calculate Results
de_de: Ergebnis berechnen
ja_jp: 結果の計算
ko_kr: 결과 계산
ru_ru: Расчет результатов
zh_cn: 计算结果
zh_tw: 計算結果

# NormalSetting
source: General Settings
de_de: Allgemeine Einstellungen
ja_jp: 一般設定
ko_kr: 일반 설정
ru_ru: Общие настройки
zh_cn: 常规设置
zh_tw: 一般設定

source: About
de_de: Über
ja_jp: バージョン情報
ko_kr: 정보
ru_ru: О программе
zh_cn: 关于
zh_tw: 關於

source: File Path
de_de: Dateipfad
ja_jp: ファイルパス
ko_kr: 파일 경로
ru_ru: Путь к файлу
zh_cn: 文件路径
zh_tw: 檔案路徑
